[
    {
  "PalabraClave": "Solución de controversias, formalismo, juicio oral, justicia alternativa, TIC",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "3",
  "Texto": "En el sistema de impartición de justicia en materia civil y familiar se ponderará en todo tiempo la solución de la controversia sobre los formalismos procesales, serán aplicables las reglas y principios del juicio oral en lo que resulte compatible; asimismo, serán considerados los beneficios de la justicia alternativa o procedimientos convencionales que pacten las partes y de conformidad con lo dispuesto en este Código Nacional, podrá tramitarse mediante el uso de las tecnologías de la información y la comunicación.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Se prioriza la solución efectiva del conflicto por encima de los formalismos procesales.",
    "Las reglas del juicio oral se aplican cuando sean compatibles con la materia civil o familiar.",
    "Se promueve el uso de justicia alternativa y acuerdos convencionales entre las partes.",
    "El proceso puede tramitarse mediante tecnologías de la información y comunicación (TIC), facilitando su acceso y eficiencia.",
    "Este artículo refleja un enfoque flexible, conciliador y adaptado a las necesidades actuales de los usuarios del sistema judicial."
    ]
    },
    {
  "PalabraClave": "Vulnerabilidad, igualdad procesal, ajustes, interés superior, perspectiva de género",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "5",
  "Texto": "En los asuntos de orden familiar y civil, y sin alterar el principio de igualdad procesal, las partes podrán revelar su condición de vulnerabilidad, a fin de que la autoridad jurisdiccional provea ajustes de procedimiento en su caso y supla oportunamente de oficio, las deficiencias de sus planteamientos sobre la base de proteger los intereses de la familia, personas mayores, niñas, niños, adolescentes, personas con discapacidad o cualquier otra persona que se encuentre en alguna condición de vulnerabilidad.",
  "Párrafos": [
    {
      "Párrafo": "1",
      "Texto": "En los casos que se involucren derechos de niñas, niños y adolescentes, así como los derechos de las mujeres, la autoridad jurisdiccional deberá actuar y resolver con base en el interés superior de las niñas, niños, o adolescentes, así como con perspectiva de género de conformidad con los Tratados Internacionales de los que el Estado Mexicano sea parte."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Las partes pueden revelar su condición de vulnerabilidad para recibir ajustes procesales adecuados.",
    "El juzgador puede suplir deficiencias de oficio para proteger derechos fundamentales.",
    "Se prioriza la protección de grupos vulnerables: familia, personas mayores, niñez, discapacidad, entre otros.",
    "Cuando se involucran derechos de niñas, niños o mujeres, se debe aplicar el interés superior y la perspectiva de género.",
    "Este artículo incorpora principios internacionales y refuerza la justicia con enfoque inclusivo y protector."
    ]
    },
    {
  "PalabraClave": "Intérprete, traductor, pueblos indígenas, afromexicanos, usos y costumbres",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "6",
  "Texto": "Tratándose de personas que pertenezcan a pueblos y comunidades indígenas y afromexicanas, la autoridad jurisdiccional deberá cerciorarse que cuenten con intérprete y traductor y en todos los casos considerará sus sistemas normativos, usos y costumbres, siempre que no contravengan lo dispuesto por la Constitución Política de los Estados Unidos Mexicanos y los Tratados Internacionales de los que el Estado mexicano sea parte.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Se garantiza el acceso lingüístico y cultural a personas indígenas y afromexicanas mediante intérprete y traductor.",
    "El juzgador debe considerar sus sistemas normativos, usos y costumbres, siempre que no contravengan la Constitución ni tratados internacionales.",
    "Este artículo promueve una justicia intercultural, respetuosa y contextualizada."
    ]
    },
    {
  "PalabraClave": "Ejercicio de la acción, derecho, violación, capacidad, legitimación",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "8",
  "Texto": "El ejercicio de la acción requiere:",
  "Párrafos": [],
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "La existencia de un derecho;"
    },
    {
      "Fracción": "II",
      "Texto": "La violación de un derecho, el incumplimiento o desconocimiento de una obligación, o la necesidad de declarar, preservar o constituir un derecho o imponer una condena, y"
    },
    {
      "Fracción": "III",
      "Texto": "La capacidad o legitimación para ejercitar la acción por sí o por quien represente legalmente, al Ministerio Público, procurador, fiscal o representante social y a quienes cuya intervención esté autorizada por la Ley en casos especiales."
    }
  ],
  "NotasOrientadoras": [
    "Para ejercer una acción se requiere: existencia del derecho, violación o necesidad de protegerlo, y legitimación para actuar.",
    "La legitimación puede recaer en la parte interesada o en representantes autorizados por ley.",
    "Este artículo establece los pilares básicos para iniciar un procedimiento judicial."
    ]
    },
    {
  "PalabraClave": "Administración pública, procedimiento judicial, garantías, embargo",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "9",
  "Texto": "Las instituciones, servicios y dependencias de la Administración Pública de la Federación y de las Entidades Federativas, tendrán dentro del procedimiento judicial, en cualquier forma en que intervengan, la misma situación que otra parte cualquiera; pero nunca podrá dictarse en su contra, mandamiento de ejecución ni providencia de embargo, y estarán exentos de prestar las garantías que este Código Nacional exija de las partes.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Las instituciones públicas tienen igualdad procesal frente a otras partes, salvo excepciones específicas.",
    "No pueden ser objeto de ejecución ni embargo, y están exentas de prestar garantías procesales.",
    "Este artículo protege el funcionamiento institucional sin excluirlas del proceso judicial."
      ]
    },
    {
  "PalabraClave": "Acción, nombre, claridad, prestación, causa",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "10",
  "Texto": "La acción procede en juicio aun cuando no se exprese su nombre o se manifieste equivocadamente, siempre que se determine con claridad la prestación que se exija de la parte demandada y el título o causa de la acción.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción judicial es válida aunque se nombre incorrectamente, si se identifica con claridad lo que se exige y su causa.",
    "Se privilegia el fondo sobre la forma, evitando nulidades innecesarias.",
    "Este artículo refuerza la flexibilidad procesal y la protección de derechos sustantivos."
      ] 
    },
    {
  "PalabraClave": "Acciones, clasificación, reales, personales, estado civil",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "11",
  "Texto": "Por razón de su objeto, las acciones se clasifican en:",
  "Párrafos": [],
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Reales;"
    },
    {
      "Fracción": "II",
      "Texto": "Personales, y"
    },
    {
      "Fracción": "III",
      "Texto": "Del estado civil de las personas."
    }
  ],
  "NotasOrientadoras": [
    "Las acciones se clasifican según su objeto: reales (sobre bienes), personales (sobre obligaciones) y del estado civil.",
    "Esta clasificación orienta el tipo de procedimiento y la naturaleza del derecho en disputa.",
    "Es clave para determinar la vía procesal adecuada en materia civil y familiar."
      ]
    },
    {
  "PalabraClave": "Acciones reales, dominio, servidumbre, usufructo, herencia, posesión",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "12",
  "Texto": "Son acciones reales las que tienen por objeto:",
  "Párrafos": [],
  "Fracciones": [
    { "Fracción": "I", "Texto": "La reclamación de un bien que pertenece a título de dominio;" },
    { "Fracción": "II", "Texto": "La reclamación de gravámenes, de servidumbre o la declaración que un fundo está libre de ellas;" },
    { "Fracción": "III", "Texto": "La reclamación de los derechos de usufructo, uso y habitación;" },
    { "Fracción": "IV", "Texto": "Las hipotecarias;" },
    { "Fracción": "V", "Texto": "Las de prenda;" },
    { "Fracción": "VI", "Texto": "Las de herencia;" },
    { "Fracción": "VII", "Texto": "Las de posesión, y" },
    { "Fracción": "VIII", "Texto": "Las demás acciones que tiendan a ejercitar un derecho contra una persona a título de propietaria o poseedora y no de obligada." }
  ],
  "NotasOrientadoras": [
    "Las acciones reales protegen derechos sobre bienes, no sobre obligaciones personales.",
    "Incluyen dominio, servidumbre, usufructo, herencia, posesión y otras figuras patrimoniales.",
    "Se ejercen contra quien posee o detenta el bien como propietario, no como obligado."
    ]
    },
    {
  "PalabraClave": "Acciones personales, obligación, cumplimiento, sucesores",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "13",
  "Texto": "Las acciones personales se deducirán para exigir el cumplimiento de una obligación personal, ya sea de dar, de hacer o no hacer determinado acto. Éstas no pueden ejercitarse sino contra la persona obligada, contra quien la haya garantizado y contra quienes legalmente le sucedan en la obligación.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Las acciones personales buscan el cumplimiento de obligaciones específicas.",
    "Solo se ejercen contra el obligado, su garante o sus sucesores legales.",
    "Este artículo delimita claramente el sujeto pasivo de la acción."
    ]
    },
    {
  "PalabraClave": "Estado civil, nacimiento, matrimonio, concubinato, defunción",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "14",
  "Texto": "Las acciones de estado civil tienen por objeto las cuestiones relativas al nacimiento, reconocimiento, defunción, matrimonio, concubinato y su cesación, pacto civil de solidaridad, sociedad de convivencia o sus equivalentes.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Las acciones de estado civil regulan situaciones personales y familiares fundamentales.",
    "Incluyen nacimiento, matrimonio, reconocimiento, defunción y formas de convivencia legal.",
    "Este artículo establece el alcance procesal de los derechos vinculados al estado civil."
      ] 
    },
    {
  "PalabraClave": "Reivindicación, propiedad, posesión, frutos, accesiones",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "15",
  "Texto": "La reivindicación compete a quien no está en posesión del bien del cual tiene la propiedad, y su efecto será declarar que la parte actora tiene dominio sobre este y ordenar la entrega con sus frutos y accesiones en los términos prescritos por el Código Civil.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción reivindicatoria protege al propietario no poseedor.",
    "Busca recuperar el bien junto con sus frutos y accesiones.",
    "Requiere acreditar dominio y ausencia de posesión."
      ] 
    },
    {
  "PalabraClave": "Tenedor, juicio, designación, poseedor",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "16",
  "Texto": "El tenedor del bien puede declinar la responsabilidad del juicio designando a quien posee a título de dueño.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "El tenedor puede deslindarse del juicio señalando al verdadero poseedor.",
    "Este artículo permite redirigir la acción hacia quien tiene la posesión con título de dominio."
      ]
    },
    {
  "PalabraClave": "Posesión, negación, pérdida, beneficio del demandante",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "17",
  "Texto": "El poseedor que niegue la posesión la perderá en beneficio del demandante.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Negar la posesión implica perderla procesalmente.",
    "Se presume mala fe o evasión, beneficiando al demandante.",
    "Este artículo refuerza la sinceridad procesal en materia de posesión."
      ]
    },
    {
  "PalabraClave": "Reivindicación, restitución, estimación, pago, mala fe",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "18",
  "Texto": "Pueden ser demandadas en reivindicación, aunque no posean el bien, quienes para evitar los efectos de la acción reivindicatoria dejaron de poseer y quienes están obligadas a restituir el bien o su estimación si la sentencia fuera condenatoria. La parte demandada que paga la estimación del bien puede ejercitar a su vez la reivindicación.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción reivindicatoria puede dirigirse contra quien dejó de poseer para evadir sus efectos.",
    "También aplica a quien debe restituir el bien o pagar su estimación.",
    "El pago no extingue el derecho: quien paga puede ejercer su propia reivindicación."
      ]
    },
    {
  "PalabraClave": "Reivindicación, bienes fuera del comercio, buena fe, pérdida, robo",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "19",
  "Texto": "No pueden reivindicarse los bienes que están fuera del comercio, los géneros no determinados al entablarse la demanda, las cosas unidas a otras por vía de accesión según lo dispuesto por el Código Civil, ni los bienes muebles pérdidas o robadas que una tercera persona haya adquirido de buena fe en almoneda, o de comerciante que en mercado público se dedica a la venta de objetos de la misma especie, sin previo reembolso del precio que se pagó. Se presume que no hay buena fe del adquirente, si de la pérdida o robo la persona propietaria dio aviso oportunamente a la autoridad, institución, dependencia u organismo público que corresponda, y ello se hizo del conocimiento público a través de los registros respectivos, y éstos pudieron ser consultados por el adquiriente.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "No procede la reivindicación sobre bienes fuera del comercio o géneros no determinados.",
    "Tampoco aplica a bienes perdidos o robados adquiridos de buena fe en mercado público, salvo reembolso.",
    "Se presume mala fe si hubo aviso público de la pérdida o robo y el adquirente pudo consultarlo."
      ]
    },
    {
  "PalabraClave": "Posesión, justo título, buena fe, restitución, frutos, accesiones, mala fe, antigüedad",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "20",
  "Texto": "A quien adquiere con justo título y de buena fe, le compete la acción plenaria de posesión para que se le restituya el bien con sus frutos y accesiones en los términos del artículo 15 de este Código Nacional, incluso cuando no lo haya prescrito.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "La acción se ejercitará contra el poseedor de mala fe o contra el que teniendo título de igual calidad al de la parte actora, ha poseído por menos tiempo el bien."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción plenaria protege al adquirente de buena fe con justo título, incluso sin prescripción.",
    "Puede ejercerse contra el poseedor de mala fe o contra quien tenga título equivalente pero menor antigüedad.",
    "Este artículo refuerza la preferencia temporal y la buena fe como criterios de restitución."
      ]
    },
    {
  "PalabraClave": "Acción negatoria",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "21",
  "Texto": "Procederá la acción negatoria para obtener la declaración de libertad o la de reducción de gravámenes de bien inmueble y la demolición de obras o señales que importen gravámenes, la cancelación o anotación en el Registro Público de la Propiedad, Oficina Registral o cualquier otra Institución análoga según la Entidad Federativa de que se trate, y conjuntamente, en su caso, la indemnización de daños y perjuicios. Cuando la sentencia sea condenatoria, la parte actora puede exigir de la parte demandada que caucione el respeto de la libertad del inmueble. Sólo se dará esta acción a quien posea a título de dueño o que tenga derecho real sobre el bien.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción negatoria busca declarar la libertad de un inmueble frente a gravámenes indebidos.",
    "Incluye demolición de obras, cancelación registral y posible indemnización.",
    "Solo procede para quien tenga título de dominio o derecho real sobre el bien."
      ]
    },
    {
  "PalabraClave": "Acción confesoria",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "22",
  "Texto": "Compete la acción confesoria al titular del derecho real sobre el inmueble y a quien posea el fundo dominante interesado en la existencia de la servidumbre. Se da esta acción contra el tenedor o poseedor jurídico que contraría el gravamen, para que se obtenga el reconocimiento, la declaración de los derechos y obligaciones del gravamen y el pago de frutos, daños y perjuicios, en su caso, y se haga cesar la violación. Si fuere la sentencia condenatoria, la parte actora puede exigir de la demandada que garantice el respeto del derecho.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción confesoria protege el ejercicio de servidumbres y otros gravámenes legítimos.",
    "Se dirige contra quien impide el ejercicio del derecho real.",
    "Busca reconocimiento, cesación de la violación y reparación de daños."
      ]
    },
    {
  "PalabraClave": "Acción hipotecaria",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "23",
  "Texto": "Se intentará la acción hipotecaria para constituir, ampliar y registrar una hipoteca, o bien, para obtener el pago o prelación del crédito que una hipoteca garantiza o cuando tenga por objeto la división, registro y extinción de ésta, así como su nulidad, cancelación o para obtener el pago o prelación del crédito que la hipoteca garantice. Procederá contra quien posea a título de dueña del fundo hipotecado y, en su caso, contra personas acreedoras. Cuando después de anotada la demanda en el Registro Público de la Propiedad, Oficina Registral o cualquier otra Institución análoga según la Entidad Federativa de que se trate y contestada ésta, cambiare el dueño y poseedor jurídico del fundo, con éste continuará el juicio.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción hipotecaria regula la constitución, modificación, extinción y ejecución de hipotecas.",
    "Puede ejercerse contra el propietario del fundo hipotecado y contra acreedores.",
    "El juicio continúa con el nuevo poseedor jurídico si hay cambio de titularidad tras la contestación."
      ]
    },
    {
  "PalabraClave": "Petición de herencia",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "24",
  "Texto": "La acción de petición de herencia se ejercitará para que sea declarado heredero quien demande, se le haga entrega de los bienes hereditarios con sus accesiones, sea indemnizado y le rindan cuentas.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción de petición de herencia permite al heredero reclamar su derecho sucesorio.",
    "Incluye entrega de bienes, accesiones, indemnización y rendición de cuentas.",
    "Requiere acreditar legitimación como heredero."
      ]
    },
    {
  "PalabraClave": "Petición de herencia, presunto heredero, albacea, cesionaria, causahabiente",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "25",
  "Texto": "La petición de herencia se deducirá por la persona presunta heredera por testamento o sucesión legítima, así como la legataria, y se da contra quien tenga el cargo de albacea y contra quien posea los bienes hereditarios con carácter de heredera o cesionaria de ésta, y contra quien no alega título ninguno de posesión del bien hereditario, o dolosamente dejó de poseerlo.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Para el caso que el juicio sucesorio ya hubiera concluido, la acción de petición de herencia deberá formularse en contra de quienes tengan la calidad de causahabientes; y de no haberse formalizado en escritura la titularidad de los bienes, esta acción real se hará en contra de quien se haya adjudicado."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción puede ejercerse por herederos presuntos o legatarios, incluso tras juicio sucesorio concluido.",
    "Se dirige contra albacea, poseedores sin título, cesionarios o causahabientes.",
    "La falta de formalización en escritura no impide la acción: se dirige contra quien se adjudicó."
      ]
    },
    {
  "PalabraClave": "Copropiedad, reivindicación, litisconsorcio activo, transacción, arbitraje",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "26",
  "Texto": "El copropietario puede deducir las acciones relativas al bien común, en calidad de dueño, salvo pacto en contrario o ley especial que así lo determine. La acción reivindicatoria puede ser ejercida por todos los copropietarios del bien común, una parte de ellos o uno solo, debiendo la autoridad jurisdiccional en este caso, llamar a todos al juicio ante la existencia de un litisconsorcio activo necesario. Por otro lado, el copropietario, no podrá transigir ni comprometer en árbitros el procedimiento, sin consentimiento unánime de los copropietarios.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Cada copropietario puede ejercer acciones sobre el bien común, salvo pacto o ley especial.",
    "La reivindicación exige litisconsorcio activo: todos deben ser llamados al juicio.",
    "No se puede transigir ni someter a arbitraje sin consentimiento unánime."
      ]
    },
    {
  "PalabraClave": "Interdicto, retener posesión, perturbación, indemnización, garantía",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "27",
  "Texto": "A quien se perturbe en la posesión jurídica, tanto originaria como derivada de un bien inmueble, compete el interdicto de retener la posesión contra quien le perturbe, mandó tal perturbación o que a sabiendas y directamente se aproveche de ella, y contra la sucesora de la despojante. El objeto de esta acción es poner término a la perturbación, indemnizar a la poseedora y que la parte condenada garantice no volver a perturbar.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "La procedencia de esta acción requiere que la perturbación consista en actos preparatorios tendientes directamente a la usurpación violenta, o a impedir el ejercicio del derecho. Que se reclame dentro de un año, y que la persona poseedora no haya obtenido la posesión de la contraria."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "El interdicto protege contra perturbaciones que amenazan la posesión jurídica.",
    "Debe reclamarse dentro de un año y no haber recuperado la posesión.",
    "Incluye indemnización y garantía de no repetición."
    ]
    },
    {
  "PalabraClave": "Recobrar posesión, despojo, restitución, sucesora, aprovechamiento",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "28",
  "Texto": "Quien sea despojada de la posesión jurídica de un bien inmueble, tanto originaria como derivada, debe ser restituida, y le compete la acción de recobrar contra quien despoje o lo haya mandado hacer, contra quien a sabiendas y directamente se aprovecha del despojo y contra la sucesora de quien despojó.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción de recobrar protege a quien ha sido despojada de la posesión jurídica.",
    "Se dirige contra el autor del despojo, quien lo ordenó, quien se benefició y su sucesora.",
    "Busca la restitución inmediata del bien."
      ]
    },
    {
  "PalabraClave": "Interdicto, recuperar posesión, indemnización, garantía, reincidencia",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "29",
  "Texto": "El interdicto de recuperar la posesión tiene por objeto reponer a la persona despojada en la posesión, indemnizarla de los daños y perjuicios, obtener de la parte condenada que garantice su abstención y a la vez apercibirla con multa y arresto para el caso de reincidencia.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Este interdicto busca reponer la posesión jurídica tras el despojo.",
    "Incluye indemnización, garantía de no repetición y sanciones por reincidencia.",
    "Refuerza la protección posesoria inmediata y efectiva."
      ]
    },
    {
  "PalabraClave": "Recuperar posesión, plazo, clandestinidad, contrato, despojo",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "30",
  "Texto": "La acción de recuperar la posesión se deducirá dentro de los dos años siguientes a los actos violentos o vías de hecho causantes del despojo. No procede en favor de aquella persona que, con relación a la parte demandada, poseía clandestinamente, por la fuerza o a ruego; pero sí contra la persona propietaria despojante que transfirió el uso y el aprovechamiento del bien por medio de contrato.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción debe ejercerse dentro de dos años desde el despojo.",
    "No protege posesiones clandestinas, violentas o precarias.",
    "Sí procede contra el propietario que transfirió el uso por contrato."
      ]
    },
    {
  "PalabraClave": "Obra nueva, suspensión, demolición, modificación, vecinos",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "31",
  "Texto": "A quien posea el fundo o derecho real sobre éste, compete la acción para suspender la conclusión de una obra perjudicial a sus posesiones, su demolición o modificación en su caso, y la restitución de las cosas al estado anterior a la obra nueva. Compete también a vecinos del lugar cuando la obra nueva se construye en bienes de uso común. Se da contra la persona que la mandó construir, sea poseedora o detentadora del bien donde se construye.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Para los efectos de esta acción por obra nueva, se entiende por tal no sólo la construcción de nueva planta, sino también la que se realiza sobre edificio antiguo, añadiéndole, quitándole o dándole una forma distinta."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción por obra nueva protege posesiones frente a construcciones perjudiciales.",
    "Aplica también a vecinos si se afecta bien de uso común.",
    "Incluye construcciones nuevas y modificaciones sustanciales sobre edificios existentes."
      ]
    },
    {
  "PalabraClave": "Obra peligrosa, ruina, derrumbe, demolición, prevención",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "33",
  "Texto": "La acción de obra peligrosa se da a quien esté en la posesión jurídica o derivada de una propiedad contigua o cercana que pueda resentirse o padecer por la ruina o derrumbe de la otra, caída de un árbol u otro objeto análogo. Su finalidad es adoptar medidas urgentes para evitar los riesgos que ofrezca el mal estado de los objetos referidos, obtener la demolición total o parcial de la obra o la destrucción del objeto peligroso.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción busca prevenir daños por obras o elementos en mal estado.",
    "Aplica a propiedades contiguas o cercanas que puedan resentirse.",
    "Permite medidas urgentes, demolición o destrucción del objeto peligroso."
      ]
    },
    {
  "PalabraClave": "Suspensión, obra peligrosa, garantía, medidas urgentes",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "34",
  "Texto": "La autoridad jurisdiccional que conozca del procedimiento podrá, previa garantía que otorgue la parte actora para responder de los daños y perjuicios que se causen a la demandada, ordenar desde luego y sin esperar la sentencia, que la persona demandada suspenda la obra o realice las obras indispensables para evitar daños a la actora.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La autoridad puede ordenar suspensión inmediata sin esperar sentencia.",
    "Requiere garantía de la parte actora para cubrir posibles daños.",
    "Se privilegia la prevención frente a riesgos inminentes."
      ]
    },
    {
  "PalabraClave": "Coadyuvancia, terceros, codeudores solidarios, obligación indivisible",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "35",
  "Texto": "Compete acción a terceras personas para coadyuvar en el juicio seguido contra sus codeudores solidarios. Igual facultad corresponde a quienes cuyo derecho dependa de la subsistencia del derecho de la parte demandada o de la actora.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "La persona deudora de obligación indivisible que sea demandada por la totalidad de la prestación puede hacer concurrir a juicio a sus codeudores, siempre y cuando su cumplimiento no sea de tal naturaleza que sólo pueda satisfacerse por la parte demandada."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Terceros pueden coadyuvar si su interés depende del resultado del juicio.",
    "El deudor de obligación indivisible puede llamar a sus codeudores, salvo que el cumplimiento sea exclusivo.",
    "Refuerza la lógica de solidaridad y defensa compartida."
      ]
    },
    {
  "PalabraClave": "Evicción, denuncia de pleito, llamamiento, emplazamiento, edictos",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "36",
  "Texto": "La parte demandada al contestar la demanda podrá denunciar el pleito a quien esté obligada a la evicción; de así considerarlo, la autoridad jurisdiccional, ordenará su llamamiento para que conteste dentro del plazo previsto por este ordenamiento para la contestación a la demanda. Quien sea llamada como obligada a la evicción, una vez salida al pleito, se convierte en principal.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "El llamamiento a juicio se hará con las mismas formalidades que el emplazamiento. La parte demandada que pida sea llamada la tercera, deberá proporcionar el domicilio de ésta, y si no lo hace no se dará curso a la petición respectiva; si afirmare que desconoce, se procederá en términos de la fracción II del artículo 209 de este Código Nacional, y será a su costa el importe de la publicación de los edictos para el emplazamiento."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La parte demandada puede denunciar el pleito a quien esté obligada a la evicción.",
    "El llamado se convierte en parte principal una vez incorporado al juicio.",
    "Debe proporcionarse domicilio o cubrir el costo de edictos si se desconoce."
      ]
    },
    {
  "PalabraClave": "Llamamiento, traslado, pruebas, defensas, copias",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "37",
  "Texto": "Quien sea llamada a juicio para que le pare perjuicio la sentencia, podrá comparecer al mismo en un plazo de quince días, y estará en aptitud de ofrecer pruebas, alegar e interponer toda clase de defensas y recursos. El llamamiento a juicio se hará corriéndole traslado con los escritos y documentos que formen la litis, que deberán ser exhibidos por quien solicite la citación o en su caso, quien lo solicite deberá cubrir el pago por derecho de expedición de las copias simples necesarias para su llamamiento.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La persona llamada a juicio tiene derecho a participar plenamente: pruebas, alegatos y recursos.",
    "Debe recibir copia de los documentos que forman la litis.",
    "El solicitante debe exhibir los escritos o cubrir el costo de las copias."
      ]
    },
    {
  "PalabraClave": "Tercero excluyente, concurrencia, procedimiento nuevo, sentencia firme",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "38",
  "Texto": "Quien se ostente como tercero e intente excluir los derechos de la parte actora y de la demandada, o los de la primera solamente, tiene la facultad de concurrir al procedimiento o de iniciar uno nuevo, en el caso de que ya se haya dictado sentencia firme en aquel.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "El tercero excluyente puede intervenir en juicio o iniciar uno nuevo si ya hay sentencia firme.",
    "Busca proteger sus derechos frente a las partes originales del procedimiento.",
    "Este artículo regula la defensa externa frente a resoluciones que afectan derechos ajenos."
      ]
    },
    {
  "PalabraClave": "Estado civil, rectificación, competencia, jurisdicción, administración",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "39",
  "Texto": "Los procedimientos relacionados con el estado civil, así como su rectificación, serán competencia de la autoridad jurisdiccional o autoridad administrativa, de conformidad con las disposiciones del Código Civil respectivo.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La competencia en materia de estado civil puede ser jurisdiccional o administrativa.",
    "Se rige por el Código Civil aplicable.",
    "Este artículo delimita la vía procesal para rectificaciones y trámites de estado civil."
      ]
    },
    {
  "PalabraClave": "Estado civil, anotación, identidad de género, acta de nacimiento",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "40",
  "Texto": "Tratándose de acciones del estado civil, salvo lo dispuesto en el párrafo siguiente, se realizará la anotación al margen o al calce del atestado respectivo, en los términos que sean ordenadas por la autoridad jurisdiccional o autoridad administrativa.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "En los procedimientos de reconocimiento de identidad de género, o de reasignación por concordancia sexo genérica, en la sentencia o constancia se deberá ordenar el levantamiento de una nueva acta de nacimiento, y la cancelación del acta de nacimiento primigenia."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Las acciones de estado civil generan anotaciones marginales o al calce según orden judicial o administrativa.",
    "En casos de identidad de género, se ordena nueva acta de nacimiento y cancelación de la anterior.",
    "Este artículo garantiza el reconocimiento jurídico de la identidad autopercibida."
      ]
    },
    {
  "PalabraClave": "Estado civil, posesión de estado, restitución, protección",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "41",
  "Texto": "Las acciones del estado civil fundadas en la posesión de estado de hijo o hija producirán el efecto que se ampare o restituya a quien la disfrute contra cualquier perturbador.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La posesión de estado de hijo o hija genera protección jurídica frente a perturbaciones.",
    "Se ampara o restituye a quien la disfruta.",
    "Este artículo refuerza el vínculo familiar como fuente de derechos."
      ]
    },
    {
  "PalabraClave": "Registro, deudores alimentarios, autoridad competente, inscripción",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "42",
  "Texto": "La autoridad competente tendrá a su cargo el control del registro de personas deudoras alimentarias morosas, en el que harán las inscripciones.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Se crea un registro oficial de personas deudoras alimentarias morosas.",
    "La autoridad competente es responsable de su control e inscripción.",
    "Este artículo busca garantizar el cumplimiento de obligaciones alimentarias."
      ]
    },
    {
  "PalabraClave": "Enriquecimiento sin causa, indemnización, detrimento, proporcionalidad",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "43",
  "Texto": "El enriquecimiento sin causa de una parte en detrimento de otra, da derecho a la parte perjudicada para ejercitar la acción de indemnización en la medida en que aquélla se enriqueció.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "El enriquecimiento injustificado genera derecho a indemnización proporcional.",
    "Protege a la parte perjudicada frente a beneficios indebidos.",
    "Este artículo refuerza la equidad patrimonial en relaciones jurídicas."
      ]
    },
    {
  "PalabraClave": "Proforma, título legal, documento, formalización, registro",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "44",
  "Texto": "Quien sea perjudicado por falta de título legal, le compete la acción proforma para exigir de quien esté obligado le extienda el documento correspondiente, siempre y cuando se acredite la titularidad registral del bien inmueble transmitido por quien esté obligado a realizar la formalización que se exige.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción proforma permite exigir la formalización documental de un bien transmitido.",
    "Requiere acreditar la titularidad registral.",
    "Este artículo garantiza la seguridad jurídica en la transmisión de inmuebles."
      ]
    },
    {
  "PalabraClave": "Herencia, legado, albacea, acciones mancomunadas",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "45",
  "Texto": "En las acciones mancomunadas por título de herencia o legado, sean reales o personales, se observarán las reglas siguientes:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Si no se ha nombrado albacea, interventor o albacea judicial o provisional, puede ejercitarlas quienes tengan un derecho reconocido de herencia o legado."
    },
    {
      "Fracción": "II",
      "Texto": "Si se ha nombrado albacea, interventor o albacea judicial o provisional, sólo a ellos compete la facultad de deducirlas en juicio, y sólo podrán hacerlo quienes tengan reconocido derecho de herencia o legado cuando, requeridos por estos, aquéllos se rehúsen a hacerlo."
    }
  ],
  "NotasOrientadoras": [
    "Las acciones por herencia o legado pueden ser ejercidas por los beneficiarios si no hay albacea.",
    "Si hay albacea, sólo él puede deducirlas, salvo negativa expresa.",
    "Este artículo regula la legitimación activa en juicios sucesorios."
    ]
    },
    {
  "PalabraClave": "Acción oblicua",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "46",
  "Texto": "Procede la acción oblicua cuando la persona acreedora tenga interés en ejercitar las acciones que competan a su deudor, cuando conste el crédito en título ejecutivo y, requerido quien sea deudor para deducirlas, descuide o rehúse hacerlo. La persona tercera demandada puede paralizar la acción pagando a la demandante el monto de su crédito.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Las acciones derivadas de derechos inherentes a la persona del deudor nunca se ejercitarán por quien sea acreedor."
    },
    {
      "Párrafo": "3",
      "Texto": "Quienes acepten la herencia que corresponda a su deudor, ejercitarán las acciones pertenecientes a éste, en los términos previstos por el Código Civil correspondiente."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "La acción oblicua permite al acreedor ejercer derechos del deudor si éste no lo hace.",
    "Debe existir título ejecutivo y negativa del deudor.",
    "No aplica a derechos personales del deudor.",
    "Herederos del deudor pueden ejercer sus acciones conforme al Código Civil."
      ]
    },
    {
  "PalabraClave": "Herederos, masa hereditaria, responsabilidad solidaria, dolo",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "47",
  "Texto": "Las acciones que pueden ejercitarse contra los herederos no obligan a éstos sino en proporción a su masa hereditaria, salvo en todo caso, la responsabilidad que les resulte cuando sea solidaria la obligación con el autor de la herencia, por ocultación de bienes o por dolo o fraude en la administración de los bienes indivisos.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Los herederos responden sólo hasta el valor de la masa hereditaria.",
    "Excepciones: obligación solidaria, ocultación de bienes, dolo o fraude.",
    "Este artículo protege la equidad en la sucesión y sanciona conductas dolosas."
      ]
    },
    {
  "PalabraClave": "Acumulación, acciones contradictorias, jurisdicción, extinción",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "48",
  "Texto": "Cuando haya varias acciones contra una misma persona, respecto de un mismo bien y provengan de una misma causa, deberán intentarse en una sola demanda y por el ejercicio de una o más quedan extinguidas las otras. No pueden acumularse en la misma demanda las acciones contrarias o contradictorias, ni las posesorias con las petitorias ni cuando una dependa del resultado de la otra. Tampoco son acumulables acciones que por su cuantía, materia o naturaleza correspondan a jurisdicciones diferentes. Queda abolida la práctica de deducir subsidiariamente acciones contrarias o contradictorias.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Las acciones conexas deben ejercerse en una sola demanda.",
    "No se permite acumular acciones contradictorias, posesorias con petitorias, ni de jurisdicciones distintas.",
    "Se prohíbe deducir acciones subsidiarias contradictorias.",
    "Este artículo ordena el ejercicio procesal y evita duplicidad o confusión."
      ]
    },
    {
  "PalabraClave": "Voluntad, acción, excepción, dependencia procesal",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "49",
  "Texto": "A nadie puede obligarse a intentar o proseguir una acción contra su voluntad, excepto cuando alguno tenga acción o excepción que dependa del ejercicio de la acción de otro, a quien pueda exigir que la deduzca, oponga o continúe desde luego; y si se rehusare, lo podrá hacer aquel.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "El ejercicio de la acción es voluntario, salvo dependencia procesal.",
    "Si una acción depende de otra, puede exigirse su ejercicio.",
    "Este artículo garantiza la autonomía procesal y regula excepciones por conexión jurídica."
      ]
    },
    {
  "PalabraClave": "Demanda, contestación, desistimiento, consentimiento, costas",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "50",
  "Texto": "Admitida la demanda, así como formulada la contestación, no podrán modificarse ni alterarse, salvo en los casos que este Código Nacional lo disponga.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "El desistimiento de la instancia que se realice con posterioridad al emplazamiento requerirá del consentimiento de la persona demandada."
    },
    {
      "Párrafo": "3",
      "Texto": "Para tal efecto, se dará vista a la contraria por el término de tres días para que manifieste su conformidad o inconformidad, y en caso de silencio, se tendrá por conforme con dicho desistimiento y su efecto será que las cosas vuelvan al estado que tenían antes de la presentación de la demanda, sin perjuicio del pago a la contraparte de las costas, daños y perjuicios, en el caso de que éste haya sido emplazado, salvo convenio en contrario."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Una vez admitida la demanda y contestada, no pueden modificarse salvo disposición expresa del Código.",
    "El desistimiento de la instancia posterior al emplazamiento requiere consentimiento de la parte demandada.",
    "Se otorgan tres días para que la parte contraria manifieste su postura; el silencio se considera conformidad.",
    "El desistimiento implica volver al estado anterior a la demanda, con obligación de pagar costas y daños si hubo emplazamiento, salvo pacto distinto."
      ]
    },
    {
  "PalabraClave": "Desistimiento, acción, extinción, resarcimiento",
  "Ley": "Código Nacional de Procedimientos Civiles y Familiares",
  "Artículo": "51",
  "Texto": "El desistimiento de la acción, la extingue, aún sin consentimiento de la parte demandada, y obliga a quien lo hizo, a resarcir a la contraria en los mismos términos del desistimiento de la instancia.",
  "Párrafos": [],
  "Fracciones": [],
  "NotasOrientadoras": [
    "El desistimiento de la acción extingue el derecho procesal ejercido.",
    "No requiere consentimiento de la parte demandada.",
    "Quien desiste debe resarcir a la contraparte en términos similares al desistimiento de la instancia.",
    "Este artículo distingue entre desistimiento de instancia (procesal) y de acción (sustantivo)."
      ]
    }


]