[
{
  "PalabraClave": "Estipulaciones inválidas",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 5,
  "Texto": "Las disposiciones de esta Ley son de orden público por lo que no producirá efecto legal, ni impedirá el goce y el ejercicio de los derechos, sea escrita o verbal, la estipulación que establezca:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Trabajos para adolescentes menores de quince años;"
    },
    {
      "Fracción": "II",
      "Texto": "Una jornada mayor que la permitida por esta Ley;"
    },
    {
      "Fracción": "III",
      "Texto": "Una jornada inhumana por lo notoriamente excesiva, dada la índole del trabajo, a juicio del Tribunal;"
    },
    {
      "Fracción": "IV",
      "Texto": "Horas extraordinarias de trabajo para los menores de dieciocho años;"
    },
    {
      "Fracción": "V",
      "Texto": "Un salario inferior al mínimo;"
    },
    {
      "Fracción": "VI",
      "Texto": "Un salario que no sea remunerador, a juicio del Tribunal;"
    },
    {
      "Fracción": "VII",
      "Texto": "Un plazo mayor de una semana para el pago de los salarios a los obreros y a los trabajadores del campo;"
    },
    {
      "Fracción": "VIII",
      "Texto": "Un lugar de recreo, fonda, cantina, café, taberna o tienda, para efectuar el pago de los salarios, siempre que no se trate de trabajadores de esos establecimientos;"
    },
    {
      "Fracción": "IX",
      "Texto": "La obligación directa o indirecta para obtener artículos de consumo en tienda o lugar determinado;"
    },
    {
      "Fracción": "X",
      "Texto": "La facultad del patrón de retener el salario por concepto de multa;"
    },
    {
      "Fracción": "XI",
      "Texto": "Un salario menor que el que se pague a otro trabajador en la misma empresa o establecimiento por trabajo de igual eficiencia, en la misma clase de trabajo o igual jornada, por consideración de edad, sexo o nacionalidad;"
    },
    {
      "Fracción": "XII",
      "Texto": "Trabajo nocturno industrial o el trabajo después de las veintidós horas, para menores de dieciséis años;"
    },
    {
      "Fracción": "XIII",
      "Texto": "Renuncia por parte del trabajador de cualquiera de los derechos o prerrogativas consignados en las normas de trabajo."
    },
    {
      "Fracción": "XIV",
      "Texto": "Encubrir una relación laboral con actos jurídicos simulados para evitar el cumplimiento de obligaciones laborales y/o de seguridad social,"
    },
    {
      "Fracción": "XV",
      "Texto": "Registrar a un trabajador con un salario menor al que realmente recibe."
    }
  ]
  },
  {
  "PalabraClave": "Aplicación de leyes y tratados",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 6,
  "Texto": "Las Leyes respectivas y los tratados celebrados y aprobados en los términos del artículo 133 de la Constitución serán aplicables a las relaciones de trabajo en todo lo que beneficien al trabajador, a partir de la fecha de la vigencia."
  },
  {
  "PalabraClave": "Proporción de trabajadores mexicanos",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 7,
  "Texto": "En toda empresa o establecimiento, el patrón deberá emplear un noventa por ciento de trabajadores mexicanos, por lo menos. En las categorías de técnicos y profesionales, los trabajadores deberán ser mexicanos, salvo que no los haya en una especialidad determinada, en cuyo caso el patrón podrá emplear temporalmente a trabajadores extranjeros, en una proporción que no exceda del diez por ciento de los de la especialidad. El patrón y los trabajadores extranjeros tendrán la obligación solidaria de capacitar a trabajadores mexicanos en la especialidad de que se trate. Los médicos al servicio de las empresas deberán ser mexicanos."
  },
  {
  "PalabraClave": "Proporción de trabajadores mexicanos",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 7,
  "Texto": "En toda empresa o establecimiento, el patrón deberá emplear un noventa por ciento de trabajadores mexicanos, por lo menos. En las categorías de técnicos y profesionales, los trabajadores deberán ser mexicanos, salvo que no los haya en una especialidad determinada, en cuyo caso el patrón podrá emplear temporalmente a trabajadores extranjeros, en una proporción que no exceda del diez por ciento de los de la especialidad. El patrón y los trabajadores extranjeros tendrán la obligación solidaria de capacitar a trabajadores mexicanos en la especialidad de que se trate. Los médicos al servicio de las empresas deberán ser mexicanos."
  },
  {
  "PalabraClave": "Definición de trabajador",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 8,
  "Texto": "Trabajador es la persona física que presta a otra, física o moral, un trabajo personal subordinado.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Para los efectos de esta disposición, se entiende por trabajo toda actividad humana, intelectual o material, independientemente del grado de preparación técnica requerido por cada profesión u oficio."
    }
  ]
  },
  {
  "PalabraClave": "Trabajador de confianza",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 9,
  "Texto": "La categoría de trabajador de confianza depende de la naturaleza de las funciones desempeñadas y no de la designación que se dé al puesto.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Son funciones de confianza las de dirección, inspección, vigilancia y fiscalización, cuando tengan carácter general, y las que se relacionen con trabajos personales del patrón dentro de la empresa o establecimiento."
    }
  ]
  },
  {
  "PalabraClave": "Definición de patrón",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 10,
  "Texto": "Patrón es la persona física o moral que utiliza los servicios de uno o varios trabajadores.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Si el trabajador, conforme a lo pactado o a la costumbre, utiliza los servicios de otros trabajadores, el patrón de aquél, lo será también de éstos."
    }
  ]
  },
  {
  "PalabraClave": "Representantes del patrón",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 11,
  "Texto": "Los directores, administradores, gerentes y demás personas que ejerzan funciones de dirección o administración en la empresa o establecimiento, serán considerados representantes del patrón y en tal concepto lo obligan en sus relaciones con los trabajadores."
  },
  {
  "PalabraClave": "Prohibición de subcontratación de personal",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 12,
  "Texto": "Queda prohibida la subcontratación de personal, entendiéndose esta cuando una persona física o moral proporciona o pone a disposición trabajadores propios en beneficio de otra.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Las agencias de empleo o intermediarios que intervienen en el proceso de contratación de personal podrán participar en el reclutamiento, selección, entrenamiento y capacitación, entre otros. Estas no se considerarán patrones ya que este carácter lo tiene quien se beneficia de los servicios."
    }
  ]
  },
  {
  "PalabraClave": "Subcontratación especializada permitida",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 13,
  "Texto": "Se permite la subcontratación de servicios especializados o de ejecución de obras especializadas que no formen parte del objeto social ni de la actividad económica preponderante de la beneficiaria de estos, siempre que el contratista esté registrado en el padrón público a que se refiere el artículo 15 de esta Ley.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Los servicios u obras complementarias o compartidas prestadas entre empresas de un mismo grupo empresarial, también serán considerados como especializados siempre y cuando no formen parte del objeto social ni de la actividad económica preponderante de la empresa que los reciba. Se entenderá por grupo empresarial lo establecido en el artículo 2, fracción X de la Ley del Mercado de Valores"
    }
  ]
  },
  {
  "PalabraClave": "Contrato escrito en subcontratación",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 14,
  "Texto": "La subcontratación de servicios especializados o de ejecución de obras especializadas deberá formalizarse mediante contrato por escrito en el que se señale el objeto de los servicios a proporcionar o las obras a ejecutar, así como el número aproximado de trabajadores que participarán en el cumplimiento de dicho contrato."
  },
  {
  "PalabraClave": "Registro ante STPS",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 15,
  "Texto": "Las personas físicas o morales que proporcionen los servicios de subcontratación, deberán contar con registro ante la Secretaría del Trabajo y Previsión Social. Para obtener el registro deberán acreditar estar al corriente de sus obligaciones fiscales y de seguridad social.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "El registro a que hace mención este artículo deberá ser renovado cada tres años."
    }
  ]
  },
  {
  "PalabraClave": "Definición de empresa y establecimiento",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 16,
  "Texto": "Para los efectos de las normas de trabajo, se entiende por empresa la unidad económica de producción o distribución de bienes o servicios y por establecimiento la unidad técnica que como sucursal, agencia u otra forma semejante, sea parte integrante y contribuya a la realización de los fines de la empresa."
  },
  {
  "PalabraClave": "Fuentes supletorias",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 17,
  "Texto": "A falta de disposición expresa en la Constitución, en esa Ley o en sus Reglamentos, o en los tratados a que se refiere el artículo 6o., se tomarán en consideración sus disposiciones que regulen casos semejantes, los principios generales que deriven de dichos ordenamientos, los principios generales del derecho, los principios generales de justicia social que derivan del artículo 123 de la Constitución, la jurisprudencia, la costumbre y la equidad."
  },
  {
  "PalabraClave": "Fuentes supletorias",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 17,
  "Texto": "A falta de disposición expresa en la Constitución, en esa Ley o en sus Reglamentos, o en los tratados a que se refiere el artículo 6o., se tomarán en consideración sus disposiciones que regulen casos semejantes, los principios generales que deriven de dichos ordenamientos, los principios generales del derecho, los principios generales de justicia social que derivan del artículo 123 de la Constitución, la jurisprudencia, la costumbre y la equidad."
  },
  {
  "PalabraClave": "Exención de impuestos",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 19,
  "Texto": "Todos los actos y actuaciones que se relacionen con la aplicación de las normas de trabajo no causarán impuesto alguno."
  },
  {
  "PalabraClave": "Relación y contrato individual de trabajo",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 20,
  "Texto": "Se entiende por relación de trabajo, cualquiera que sea el acto que le dé origen, la prestación de un trabajo personal subordinado a una persona, mediante el pago de un salario.",
  "Párrafos": [
    {
      "Párrafo": "1",
      "Texto": "Contrato individual de trabajo, cualquiera que sea su forma o denominación, es aquel por virtud del cual una persona se obliga a prestar a otra un trabajo personal subordinado, mediante el pago de un salario."
    },
    {
      "Párrafo": "2",
      "Texto": "La prestación de un trabajo a que se refiere el párrafo primero y el contrato celebrado producen los mismos efectos."
    }
  ]
  },
  {
    "PalabraClave": "Presunción de relación laboral",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 21,
    "Texto": "Se presumen la existencia del contrato y de la relación de trabajo entre el que presta un trabajo personal y el que lo recibe."
  },
  {
    "PalabraClave": "Trabajo de menores de edad",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 22,
    "Texto": "Los mayores de quince años pueden prestar libremente sus servicios con las limitaciones establecidas en esta Ley.",
    "Párrafos": [
      {
        "Párrafo": "2",
        "Texto": "Los mayores de quince y menores de dieciséis necesitan autorización de sus padres o tutores y a falta de ellos, del sindicato a que pertenezcan, del Tribunal, del Inspector del Trabajo o de la Autoridad Política."
      },
      {
        "Párrafo": "3",
        "Texto": "Los menores trabajadores deben percibir el pago de sus salarios y ejercitar, en su caso, las acciones que les correspondan."
      }
    ]
  },
  {
    "PalabraClave": "Prohibición de trabajo infantil",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": "22 Bis",
    "Texto": "Queda prohibido el trabajo de menores de quince años; no podrá utilizarse el trabajo de mayores de esta edad y menores de dieciocho años que no hayan terminado su educación básica obligatoria, salvo los casos que apruebe la autoridad laboral correspondiente en que a su juicio haya compatibilidad entre los estudios y el trabajo."
  },
  {
    "PalabraClave": "Sanciones por trabajo infantil",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 23,
    "Texto": "Cuando las autoridades del trabajo detecten trabajando a un menor de quince años fuera del círculo familiar, ordenará que de inmediato cese en sus labores. Al patrón que incurra en esta conducta se le sancionará con la pena establecida en el artículo 995 Bis de esta Ley.",
    "Párrafos": [
      {
        "Párrafo": "2",
        "Texto": "En caso de que el menor no estuviere devengando el salario que perciba un trabajador que preste los mismos servicios, el patrón deberá resarcirle las diferencias."
      },
      {
        "Párrafo": "3",
        "Texto": "Queda prohibido el trabajo de menores de dieciocho años dentro del círculo familiar en cualquier tipo de actividad que resulte peligrosa para su salud, su seguridad o su moralidad, o que afecte el ejercicio de sus derechos y, con ello, su desarrollo integral."
      }
    ]
  },
  {
    "PalabraClave": "Formalización de condiciones laborales",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 24,
    "Texto": "Las condiciones de trabajo deben hacerse constar por escrito cuando no existan contratos colectivos aplicables. Se harán dos ejemplares, por lo menos, de los cuales quedará uno en poder de cada parte."
  },
  {
  "PalabraClave": "Contenido mínimo del contrato individual",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 25,
  "Texto": "El escrito en que consten las condiciones de trabajo deberá contener:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Nombre, nacionalidad, edad, sexo, estado civil, Clave Única de Registro de Población, Registro Federal de Contribuyentes y domicilio del trabajador y del patrón."
    },
    {
      "Fracción": "II",
      "Texto": "Si la relación de trabajo es para obra o tiempo determinado, por temporada, de capacitación inicial o por tiempo indeterminado y, en su caso, si está sujeta a un periodo de prueba."
    },
    {
      "Fracción": "III",
      "Texto": "El servicio o servicios que deban prestarse, los que se determinarán con la mayor precisión posible."
    },
    {
      "Fracción": "IV",
      "Texto": "El lugar o los lugares donde deba prestarse el trabajo."
    },
    {
      "Fracción": "V",
      "Texto": "La duración de la jornada."
    },
    {
      "Fracción": "VI",
      "Texto": "La forma y el monto del salario."
    },
    {
      "Fracción": "VII",
      "Texto": "El día y el lugar de pago del salario."
    },
    {
      "Fracción": "VIII",
      "Texto": "La indicación de que el trabajador será capacitado o adiestrado en los términos de los planes y programas establecidos o que se establezcan en la empresa, conforme a lo dispuesto en esta Ley."
    },
    {
      "Fracción": "IX",
      "Texto": "Otras condiciones de trabajo, tales como días de descanso, vacaciones y demás que convengan el trabajador y el patrón."
    },
    {
      "Fracción": "X",
      "Texto": "La designación de beneficiarios a los que refiere el artículo 501 de esta ley, para el pago de los salarios y prestaciones devengadas y no cobradas a la muerte de los trabajadores o las que se generen por su fallecimiento o desaparición derivada de un acto delincuencial."
    }
  ]
  },
  {
    "PalabraClave": "Formalidad del contrato",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 26,
    "Texto": "La falta del escrito a que se refieren los artículos 24 y 25 no priva al trabajador de los derechos que deriven de las normas de trabajo y de los servicios prestados, pues se imputará al patrón la falta de esa formalidad."
  },
  {
    "PalabraClave": "Compatibilidad del servicio",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 27,
    "Texto": "Si no se hubiese determinado el servicio o servicios que deban prestarse, el trabajador quedará obligado a desempeñar el trabajo que sea compatible con sus fuerzas, aptitudes, estado o condición y que sea del mismo género de los que formen el objeto de la empresa o establecimiento."
  },
  {
  "PalabraClave": "Servicios en el extranjero",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 28,
  "Texto": "En la prestación de los servicios de trabajadores mexicanos fuera de la República, contratados en territorio nacional y cuyo contrato de trabajo se rija por esta Ley, se observará lo siguiente:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Las condiciones de trabajo se harán constar por escrito y contendrán además de las estipulaciones del artículo 25 de esta Ley, las siguientes:",
      "Incisos": [
        {
          "Inciso": "a)",
          "Texto": "Indicar que los gastos de repatriación quedan a cargo del empresario contratante."
        },
        {
          "Inciso": "b)",
          "Texto": "Las condiciones de vivienda decorosa e higiénica que disfrutará el trabajador, mediante arrendamiento o cualquier otra forma."
        },
        {
          "Inciso": "c)",
          "Texto": "La forma y condiciones en las que se le otorgará al trabajador y de su familia, en su caso, la atención médica correspondiente."
        },
        {
          "Inciso": "d)",
          "Texto": "Los mecanismos para informar al trabajador acerca de las autoridades consulares y diplomáticas mexicanas a las que podrá acudir en el extranjero y de las autoridades competentes del país a donde se prestarán los servicios, cuando el trabajador considere que sus derechos han sido menoscabados, a fin de ejercer la acción legal conducente."
        }
      ]
    },
    {
      "Fracción": "II",
      "Texto": "El patrón señalará en el contrato de trabajo domicilio dentro de la República para todos los efectos legales."
    },
    {
      "Fracción": "III",
      "Texto": "El contrato de trabajo será sometido a la aprobación del Centro Federal de Conciliación y Registro Laboral, el cual, después de comprobar que éste cumple con las disposiciones a que se refieren las fracciones I y II de este artículo lo aprobará."
    },
    {
      "Fracción": "IV",
      "Texto": "El trabajador y el patrón deberán anexar al contrato de trabajo la visa o permiso de trabajo emitido por las autoridades consulares o migratorias del país donde deban prestarse los servicios."
    },
    {
      "Fracción": "V",
      "Texto": "Una vez que el patrón comprueba ante el Centro Federal de Conciliación y Registro Laboral que ha cumplido las obligaciones contraídas, se ordenará la cancelación de la fianza o la devolución del depósito que esta hubiere determinado."
    }
  ]
  },
  {
  "PalabraClave": "Trabajo en el extranjero por acuerdo bilateral",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "28-A",
  "Texto": "En el caso de trabajadores mexicanos reclutados y seleccionados en México, para un empleo concreto en el exterior de duración determinada, a través de mecanismos acordados por el gobierno de México con un gobierno extranjero, se atenderá a lo dispuesto por dicho acuerdo, que en todo momento salvaguardará los derechos de los trabajadores, conforme a las bases siguientes:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Las condiciones generales de trabajo para los mexicanos en el país receptor serán dignas e iguales a las que se otorgue a los trabajadores de aquel país."
    },
    {
      "Fracción": "II",
      "Texto": "Al expedirse la visa o permiso de trabajo por la autoridad consular o migratoria del país donde se prestará el servicio, se entenderá que dicha autoridad tiene conocimiento de que se establecerá una relación laboral entre el trabajador y un patrón determinado."
    },
    {
      "Fracción": "III",
      "Texto": "Las condiciones para la repatriación, la vivienda, la seguridad social y otras prestaciones se determinarán en el acuerdo."
    },
    {
      "Fracción": "IV",
      "Texto": "El reclutamiento y la selección será organizada por la Secretaría del Trabajo y Previsión Social, a través del Servicio Nacional de Empleo, en coordinación con las autoridades estatales y municipales."
    },
    {
      "Fracción": "V",
      "Texto": "Contendrá mecanismos para informar al trabajador acerca de las autoridades consulares y diplomáticas mexicanas a las que podrá acudir en el extranjero y de las autoridades competentes del país a donde se prestarán los servicios, cuando el trabajador considere que sus derechos han sido menoscabados, a fin de ejercer la acción legal conducente."
    }
  ]
  },
  {
  "PalabraClave": "Trabajo en el extranjero por colocación privada",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "28-B",
  "Texto": "En el caso de trabajadores mexicanos reclutados y seleccionados en México, para un empleo concreto en el exterior de duración determinada, que sean colocados por entidades privadas, se observarán las normas siguientes:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Las agencias de colocación de trabajadores deberán estar debidamente autorizadas y registradas, según corresponda, conforme a lo dispuesto en las disposiciones legales aplicables."
    },
    {
      "Fracción": "II",
      "Texto": "Las agencias de colocación de trabajadores deberán cerciorarse de:",
      "Incisos": [
        {
          "Inciso": "a)",
          "Texto": "La veracidad de las condiciones generales de trabajo que se ofrecen, así como de las relativas a vivienda, seguridad social y repatriación a que estarán sujetos los trabajadores. Dichas condiciones deberán ser dignas y no implicar discriminación de cualquier tipo."
        },
        {
          "Inciso": "b)",
          "Texto": "Que los aspirantes hayan realizado los trámites para la expedición de visa o permiso de trabajo por la autoridad consular o migratoria del país donde se prestará el servicio."
        }
      ]
    },
    {
      "Fracción": "III",
      "Texto": "Las agencias de colocación deberán informar a los trabajadores sobre la protección consular a la que tienen derecho y la ubicación de la Embajada o consulados mexicanos en el país que corresponda, además de las autoridades competentes a las que podrán acudir para hacer valer sus derechos en el país de destino."
    }
  ]
  },
  
  {
    "PalabraClave": "Prohibición de trabajo de menores en el extranjero",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 29,
    "Texto": "Queda prohibida la utilización de menores de dieciocho años para la prestación de servicios fuera de la República, salvo que se trate de técnicos, profesionales, artistas, deportistas y, en general, de trabajadores especializados."
  },
  {
    "PalabraClave": "Prestación de servicios fuera de residencia habitual",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 30,
    "Texto": "La prestación de servicios dentro de la República, pero en lugar diverso de la residencia habitual del trabajador y a distancia mayor de cien kilómetros, se regirá por las disposiciones contenidas en el artículo 28, fracción I, en lo que sean aplicables."
  },
  {
    "PalabraClave": "Obligaciones laborales y buena fe",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 31,
    "Texto": "Los contratos y las relaciones de trabajo obligan a lo expresamente pactado y a las consecuencias que sean conformes a las normas de trabajo, a la buena fe y a la equidad."
  },
  {
    "PalabraClave": "Responsabilidad civil del trabajador",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 32,
    "Texto": "El incumplimiento de las normas de trabajo por lo que respecta al trabajador sólo da lugar a su responsabilidad civil, sin que en ningún caso pueda hacerse coacción sobre su persona."
  },
  {
  "PalabraClave": "Renuncia de derechos y convenios laborales",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 33,
  "Texto": "Es nula la renuncia que los trabajadores hagan de los salarios devengados, de las indemnizaciones y demás prestaciones que deriven de los servicios prestados, cualquiera que sea la forma o denominación que se le dé.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Todo convenio o liquidación, para ser válido, deberá hacerse por escrito y contener una relación circunstanciada de los hechos que lo motiven y de los derechos comprendidos en él. Será ratificado ante los Centros de Conciliación o al Tribunal según corresponda, que lo aprobará siempre que no contenga renuncia de los derechos de los trabajadores."
    },
    {
      "Párrafo": "3",
      "Texto": "Cuando el convenio sea celebrado sin la intervención de las autoridades, será susceptible de ser reclamada la nulidad ante el Tribunal, solamente de aquello que contenga renuncia de los derechos de los trabajadores, conservando su validez el resto de las cláusulas convenidas."
    }
  ]
 },
 {
  "PalabraClave": "Convenios sindicales y derechos laborales",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": 34,
  "Texto": "En los convenios celebrados entre los sindicatos y los patrones que puedan afectar derechos de los trabajadores, se observarán las normas siguientes:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Regirán únicamente para el futuro, por lo que no podrán afectar las prestaciones ya devengadas."
    },
    {
      "Fracción": "II",
      "Texto": "No podrán referirse a trabajadores individualmente determinados."
    },
    {
      "Fracción": "III",
      "Texto": "Cuando se trate de reducción de los trabajos, el reajuste se efectuará de conformidad con lo dispuesto en el artículo 437."
    }
  ]
  },
  {
    "PalabraClave": "Tipos de relación laboral, contrato",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 35,
    "Texto": "Las relaciones de trabajo pueden ser para obra o tiempo determinado, por temporada o por tiempo indeterminado y en su caso podrá estar sujeto a prueba o a capacitación inicial. A falta de estipulaciones expresas, la relación será por tiempo indeterminado."
  },
  {
    "PalabraClave": "Obra determinada, contrato",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 36,
    "Texto": "El señalamiento de una obra determinada puede únicamente estipularse cuando lo exija su naturaleza."
  },
  {
    "PalabraClave": "Tiempo determinado, contrato",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 37,
    "Texto": "El señalamiento de un tiempo determinado puede únicamente estipularse en los casos siguientes:",
    "Fracciones": [
      {
        "Fracción": "I",
        "Texto": "Cuando lo exija la naturaleza del trabajo que se va a prestar."
      },
      {
        "Fracción": "II", "Texto": "Cuando tenga por objeto substituir temporalmente a otro trabajador."},
      {
        "Fracción": "III",
        "Texto": "En los demás casos previstos por esta Ley."
      }
    ]
  },
  {
    "PalabraClave": "Relaciones laborales en minería, contrato",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 38,
    "Texto": "Las relaciones de trabajo para la explotación de minas que carezcan de minerales costeables o para la restauración de minas abandonadas o paralizadas, pueden ser por tiempo u obra determinado o para la inversión de capital determinado."
  },
  {
    "PalabraClave": "Prórroga de relación laboral, contrato",
    "Ley": "Ley Federal del Trabajo",
    "Artículo": 39,
    "Texto": "Si vencido el término que se hubiese fijado subsiste la materia del trabajo, la relación quedará prorrogada por todo el tiempo que perdure dicha circunstancia."
  },
  {
  "PalabraClave": "Periodo de prueba",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "39-A",
  "Texto": "En las relaciones de trabajo por tiempo indeterminado o cuando excedan de ciento ochenta días, podrá establecerse un periodo a prueba, el cual no podrá exceder de treinta días, con el único fin de verificar que el trabajador cumple con los requisitos y conocimientos necesarios para desarrollar el trabajo que se solicita.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "El periodo de prueba a que se refiere el párrafo anterior, podrá extenderse hasta ciento ochenta días, sólo cuando se trate de trabajadores para puestos de dirección, gerenciales y demás personas que ejerzan funciones de dirección o administración en la empresa o establecimiento de carácter general o para desempeñar labores técnicas o profesionales especializadas."
    },
    {
      "Párrafo": "3",
      "Texto": "Durante el período de prueba el trabajador disfrutará del salario, la garantía de la seguridad social y de las prestaciones de la categoría o puesto que desempeñe. Al término del periodo de prueba, de no acreditar el trabajador que satisface los requisitos y conocimientos necesarios para desarrollar las labores, a juicio del patrón, tomando en cuenta la opinión de la Comisión Mixta de Productividad, Capacitación y Adiestramiento en los términos de esta Ley, así como la naturaleza de la categoría o puesto, se dará por terminada la relación de trabajo, sin responsabilidad para el patrón."
    }
  ]
  },
  {
  "PalabraClave": "Capacitación inicial",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "39-B",
  "Texto": "Se entiende por relación de trabajo para capacitación inicial, aquella por virtud de la cual un trabajador se obliga a prestar sus servicios subordinados, bajo la dirección y mando del patrón, con el fin de que adquiera los conocimientos o habilidades necesarios para la actividad para la que vaya a ser contratado.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "La vigencia de la relación de trabajo a que se refiere el párrafo anterior, tendrá una duración máxima de tres meses o en su caso, hasta de seis meses sólo cuando se trate de trabajadores para puestos de dirección, gerenciales y demás personas que ejerzan funciones de dirección o administración en la empresa o establecimiento de carácter general o para desempeñar labores que requieran conocimientos profesionales especializados. Durante ese tiempo el trabajador disfrutará del salario, la garantía de la seguridad social y de las prestaciones de la categoría o puesto que desempeñe. Al término de la capacitación inicial, de no acreditar competencia el trabajador, a juicio del patrón, tomando en cuenta la opinión de la Comisión Mixta de Productividad, Capacitación y Adiestramiento en los términos de esta Ley, así como a la naturaleza de la categoría o puesto, se dará por terminada la relación de trabajo, sin responsabilidad para el patrón."
    }
  ] 
  },
  {
  "PalabraClave": "Formalidad y seguridad social",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "39-C",
  "Texto": "La relación de trabajo con periodo a prueba o de capacitación inicial, se hará constar por escrito garantizando la seguridad social del trabajador; en caso contrario se entenderá que es por tiempo indeterminado, y se garantizarán los derechos de seguridad social del trabajador."
  },
  {
  "PalabraClave": "Improrrogabilidad",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "39-D",
  "Texto": "Los periodos a prueba y de capacitación inicial son improrrogables.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Dentro de una misma empresa o establecimiento, no podrán aplicarse al mismo trabajador en forma simultánea o sucesiva periodos de prueba o de capacitación inicial, ni en más de una ocasión, ni tratándose de puestos de trabajo distintos, o de ascensos, aun cuando concluida la relación de trabajo surja otra con el mismo patrón, a efecto de garantizar los derechos de la seguridad social del trabajador."
    }
  ]
  },
  {
  "PalabraClave": "Antigüedad",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "39-E",
  "Texto": "Cuando concluyan los periodos a prueba o de capacitación inicial y subsista la relación de trabajo, ésta se considerará por tiempo indeterminado y el tiempo de vigencia de aquellos se computará para efectos del cálculo de la antigüedad."
  },
  {
  "PalabraClave": "Labores discontinuas",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "39-F",
  "Texto": "Las relaciones de trabajo por tiempo indeterminado serán continuas por regla general, pero podrán pactarse para labores discontinuas cuando los servicios requeridos sean para labores fijas y periódicas de carácter discontinuo, en los casos de actividades de temporada o que no exijan la prestación de servicios toda la semana, el mes o el año."
  },
  {
  "PalabraClave": "Duración máxima",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "40",
  "Texto": "Los trabajadores en ningún caso estarán obligados a prestar sus servicios por más de un año."
  },
  {
  "PalabraClave": "Substitución de patrón",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "41",
  "Texto": "La substitución de patrón no afectará las relaciones de trabajo de la empresa o establecimiento. El patrón substituido será solidariamente responsable con el nuevo por las obligaciones derivadas de las relaciones de trabajo y de la Ley, nacidas antes de la fecha de la substitución, hasta por el término de seis meses; concluido éste, subsistirá únicamente la responsabilidad del nuevo patrón.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "El término de seis meses a que se refiere el párrafo anterior, se contará a partir de la fecha en que se hubiese dado aviso de la substitución al sindicato o a los trabajadores."
    }
  ]
  },
  {
    "PalabraClave": "Suspensión de Obligaciones Laborales, Laborales, Salario",
    "Ley": "LFT",
    "Artículo": "42",
    "Texto": "Son causas de suspensión temporal de las obligaciones de prestar el servicio y pagar el salario, sin responsabilidad para el trabajador y el patrón:",
    "Fracciones": [
      { "Fracción": "I", "Texto": "La enfermedad contagiosa del trabajador;" },
      { "Fracción": "II", "Texto": "La incapacidad temporal ocasionada por un accidente o enfermedad que no constituya un riesgo de trabajo;" },
      { "Fracción": "III", "Texto": "La prisión preventiva del trabajador seguida de sentencia absolutoria. Si el trabajador obró en defensa de la persona o de los intereses del patrón, tendrá éste la obligación de pagar los salarios que hubiese dejado de percibir aquél;" },
      { "Fracción": "IV", "Texto": "El arresto del trabajador;" },
      { "Fracción": "V", "Texto": "El cumplimiento de los servicios y el desempeño de los cargos mencionados en el artículo 5o de la Constitución, y el de las obligaciones consignadas en el artículo 31, fracción III de la misma Constitución;" },
      { "Fracción": "VI", "Texto": "La designación de los trabajadores como representantes ante los organismos estatales, Comisión Nacional de los Salarios Mínimos, Comisión Nacional para la Participación de los Trabajadores en las Utilidades de las Empresas y otros semejantes;" },
      { "Fracción": "VII", "Texto": "La Falta (sic DOF 04-06-2019) de los documentos que exijan las Leyes y reglamentos, necesarios para la prestación del servicio, cuando sea imputable al trabajador;" },
      { "Fracción": "VIII", "Texto": "La conclusión de la temporada en el caso de los trabajadores contratados bajo esta modalidad;" },
      { "Fracción": "IX", "Texto": "La licencia a que se refiere el artículo 140 Bis de la Ley del Seguro Social." }
    ],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Suspensión sin responsabilidad para ambas partes",
      "Causas médicas, legales y administrativas",
      "Protección en caso de prisión preventiva y representación institucional",
      "Aplicable a trabajadores temporales y con licencias especiales"
    ]
  },
  {
    "PalabraClave": "Contingencia Sanitaria Suspensión Laboral",
    "Ley": "LFT",
    "Artículo": "42 Bis",
    "Texto": "En los casos en que las autoridades competentes emitan una declaratoria de contingencia sanitaria, conforme a las disposiciones aplicables, que implique la suspensión de las labores, se estará a lo dispuesto por el artículo 429, fracción IV de esta Ley.",
    "Fracciones": [],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Suspensión por contingencia sanitaria",
      "Remisión al artículo 429 fracción IV",
      "Aplicación condicionada a declaratoria oficial"
    ]
  },
  {
    "PalabraClave": "Efectos Suspensión Laboral IMSS Arresto Temporada",
    "Ley": "LFT",
    "Artículo": "43",
    "Texto": "La suspensión a que se refiere el artículo 42 surtirá efectos:",
    "Fracciones": [
      {
        "Fracción": "I",
        "Texto": "En los casos de las fracciones I y II del artículo anterior, desde la fecha en que el patrón tenga conocimiento de la enfermedad contagiosa o de la en que se produzca la incapacidad para el trabajo, hasta que termine el período fijado por el Instituto Mexicano del Seguro Social o antes si desaparece la incapacidad para el trabajo, sin que la suspensión pueda exceder del término fijado en la Ley del Seguro Social para el tratamiento de las enfermedades que no sean consecuencia de un riesgo de trabajo;"
      },
      {
        "Fracción": "II",
        "Texto": "Tratándose de las fracciones III y IV, desde el momento en que el trabajador acredite estar detenido a disposición de la autoridad judicial o administrativa, hasta la fecha en que cause ejecutoria la sentencia que lo absuelva o termine el arresto. Si obtiene su libertad provisional, deberá presentarse a trabajar en un plazo de quince días siguientes a su liberación, salvo que se le siga proceso por delitos intencionales en contra del patrón o sus compañeros de trabajo;"
      },
      {
        "Fracción": "III",
        "Texto": "En los casos de las fracciones V y VI, desde la fecha en que deban prestarse los servicios o desempeñarse los cargos, hasta por un periodo de seis años;"
      },
      {
        "Fracción": "IV",
        "Texto": "En el caso de la fracción VII, desde la fecha en que el patrón tenga conocimiento del hecho, hasta por un periodo de dos meses;"
      },
      {
        "Fracción": "V",
        "Texto": "En el caso de la fracción VIII, desde la fecha de conclusión de la temporada, hasta el inicio de la siguiente."
      }
    ],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Duración específica de la suspensión según causa",
      "Referencia directa a fracciones del artículo 42",
      "Condiciones temporales según IMSS, autoridad judicial o calendario laboral"
    ]
  },
  {
    "PalabraClave": "Guardia Nacional Antigüedad Servicio Constitucional",
    "Ley": "LFT",
    "Artículo": "44",
    "Texto": "Cuando los trabajadores sean llamados para alistarse y servir en la Guardia Nacional, de conformidad con lo dispuesto en el artículo 31, fracción III, de la Constitución, el tiempo de servicios se tomará en consideración para determinar su antigüedad.",
    "Fracciones": [],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Servicio en Guardia Nacional cuenta para antigüedad",
      "Remisión constitucional al artículo 31 fracción III",
      "Protección del historial laboral en caso de llamado oficial"
    ]
  },
  {
    "PalabraClave": "Reincorporación Suspensión Laboral Plazos",
    "Ley": "LFT",
    "Artículo": "45",
    "Texto": "El trabajador deberá regresar a su trabajo:",
    "Fracciones": [
      {
        "Fracción": "I",
        "Texto": "En los casos de las fracciones I, II, IV y VII del artículo 42, al día siguiente de la fecha en que termine la causa de la suspensión;"
      },
      {
        "Fracción": "II",
        "Texto": "En los casos de las fracciones III, V y VI del artículo 42, dentro de los quince días siguientes a la terminación de la causa de la suspensión"
      }
    ],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Plazos de reincorporación según causa de suspensión",
      "Distinción entre retorno inmediato y retorno diferido",
      "Referencia directa a fracciones del artículo 42"
    ]
  },
  {
    "PalabraClave": "Rescisión Relación Laboral Causa Justificada",
    "Ley": "LFT",
    "Artículo": "46",
    "Texto": "El trabajador o el patrón podrá rescindir en cualquier tiempo la relación de trabajo, por causa justificada, sin incurrir en responsabilidad.",
    "Fracciones": [],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Rescisión unilateral con causa justificada",
      "Aplicable tanto al trabajador como al patrón",
      "Sin responsabilidad legal si hay justificación"
    ]
  },
  {
    "PalabraClave": "Rescisión Justificada, Causas de terminacion laboral",
    "Ley": "LFT",
    "Artículo": "47",
    "Texto": "Son causas de rescisión de la relación de trabajo, sin responsabilidad para el patrón:",
    "Fracciones": [
      {
        "Fracción": "I",
        "Texto": "Engañarlo el trabajador o en su caso, el sindicato que lo hubiese propuesto o recomendado con certificados falsos o referencias en los que se atribuyan al trabajador capacidad, aptitudes o facultades de que carezca. Esta causa de rescisión dejará de tener efecto después de treinta días de prestar sus servicios el trabajador;"
      },
      {
        "Fracción": "II",
        "Texto": "Incurrir el trabajador, durante sus labores, en faltas de probidad u honradez, en actos de violencia, amagos, injurias o malos tratamientos en contra del patrón, sus familiares o del personal directivo o administrativo de la empresa o establecimiento, o en contra de clientes y proveedores del patrón, salvo que medie provocación o que obre en defensa propia;"
      },
      {
        "Fracción": "III",
        "Texto": "Cometer el trabajador contra alguno de sus compañeros, cualquiera de los actos enumerados en la fracción anterior, si como consecuencia de ellos se altera la disciplina del lugar en que se desempeña el trabajo;"
      },
      {
        "Fracción": "IV",
        "Texto": "Cometer el trabajador, fuera del servicio, contra el patrón, sus familiares o personal directivo administrativo, alguno de los actos a que se refiere la fracción II, si son de tal manera graves que hagan imposible el cumplimiento de la relación de trabajo;"
      },
      {
        "Fracción": "V",
        "Texto": "Ocasionar el trabajador, intencionalmente, perjuicios materiales durante el desempeño de las labores o con motivo de ellas, en los edificios, obras, maquinaria, instrumentos, materias primas y demás objetos relacionados con el trabajo;"
      },
      {
        "Fracción": "VI",
        "Texto": "Ocasionar el trabajador los perjuicios de que habla la fracción anterior siempre que sean graves, sin dolo, pero con negligencia tal, que ella sea la causa única del perjuicio;"
      },
      {
        "Fracción": "VII",
        "Texto": "Comprometer el trabajador, por su imprudencia o descuido inexcusable, la seguridad del establecimiento o de las personas que se encuentren en él;"
      },
      {
        "Fracción": "VIII",
        "Texto": "Cometer el trabajador actos inmorales o de hostigamiento y/o acoso sexual contra cualquier persona en el establecimiento o lugar de trabajo;"
      },
      {
        "Fracción": "IX",
        "Texto": "Revelar el trabajador los secretos de fabricación o dar a conocer asuntos de carácter reservado, con perjuicio de la empresa;"
      },
      {
        "Fracción": "X",
        "Texto": "Tener el trabajador más de tres faltas de asistencia en un período de treinta días, sin permiso del patrón o sin causa justificada;"
      },
      {
        "Fracción": "XI",
        "Texto": "Desobedecer el trabajador al patrón o a sus representantes, sin causa justificada, siempre que se trate del trabajo contratado;"
      },
      {
        "Fracción": "XII",
        "Texto": "Negarse el trabajador a adoptar las medidas preventivas o a seguir los procedimientos indicados para evitar accidentes o enfermedades;"
      },
      {
        "Fracción": "XIII",
        "Texto": "Concurrir el trabajador a sus labores en estado de embriaguez o bajo la influencia de algún narcótico o droga enervante, salvo que, en este último caso, exista prescripción médica. Antes de iniciar su servicio, el trabajador deberá poner el hecho en conocimiento del patrón y presentar la prescripción suscrita por el médico;"
      },
      {
        "Fracción": "XIV",
        "Texto": "La sentencia ejecutoriada que imponga al trabajador una pena de prisión, que le impida el cumplimiento de la relación de trabajo;"
      },
      {
        "Fracción": "XIV Bis",
        "Texto": "La falta de documentos que exijan las leyes y reglamentos, necesarios para la prestación del servicio cuando sea imputable al trabajador y que exceda del periodo a que se refiere la fracción IV del artículo 43;"
      },
      {
        "Fracción": "XV",
        "Texto": "Las análogas a las establecidas en las fracciones anteriores, de igual manera graves y de consecuencias semejantes en lo que al trabajo se refiere."
      }
    ],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Causas específicas para rescisión sin responsabilidad del patrón",
      "Incluye actos dentro y fuera del servicio",
      "Protección de seguridad, disciplina y confidencialidad",
      "Referencia cruzada con artículo 43 fracción IV"
    ]
  },
  {
    "PalabraClave": "Despido, Reinstalación, Indemnización, Juicio Laboral",
    "Ley": "LFT",
    "Artículo": "48",
    "Texto": "El trabajador podrá solicitar ante la Autoridad Conciliadora, o ante el Tribunal si no existe arreglo conciliatorio, que se le reinstale en el trabajo que desempeñaba, o que se le indemnice con el importe de tres meses de salario, a razón del que corresponda a la fecha en que se realice el pago, observando previamente las disposiciones relativas al procedimiento de conciliación previsto en el artículo 684-A y subsiguientes.",
    "Fracciones": [],
    "Párrafos": [
      {
        "Párrafo": "2",
        "Texto": "Si en el juicio correspondiente no comprueba el patrón la causa de la rescisión, el trabajador tendrá derecho, además, cualquiera que hubiese sido la acción intentada, a que se le paguen los salarios vencidos computados desde la fecha del despido hasta por un período máximo de doce meses, en términos de lo preceptuado en la última parte del párrafo anterior."
      },
      {
        "Párrafo": "3",
        "Texto": "Si al término del plazo señalado en el párrafo anterior no ha concluido el procedimiento o no se ha dado cumplimiento a la sentencia, se pagarán también al trabajador los intereses que se generen sobre el importe de quince meses de salario, a razón del dos por ciento mensual, capitalizable al momento del pago. Lo dispuesto en este párrafo no será aplicable para el pago de otro tipo de indemnizaciones o prestaciones."
      },
      {
        "Párrafo": "4",
        "Texto": "En caso de muerte del trabajador, dejarán de computarse los salarios vencidos como parte del conflicto, a partir de la fecha del fallecimiento."
      },
      {
        "Párrafo": "5",
        "Texto": "Los abogados, litigantes o representantes que promuevan acciones, excepciones, incidentes, diligencias, ofrecimiento de pruebas, recursos y, en general toda actuación en forma notoriamente improcedente, con la finalidad de prolongar, dilatar u obstaculizar la sustanciación o resolución de un juicio laboral, se le impondrá una multa de 100 a 1000 veces la Unidad de Medida y Actualización."
      }
    ],
    "NotasOrientadoras": [
      "Opciones del trabajador ante despido: reinstalación o indemnización",
      "Límite de doce meses para salarios vencidos",
      "Intereses por demora en cumplimiento de sentencia",
      "Extinción del conflicto por fallecimiento",
      "Sanción por litigio dilatorio o improcedente"
    ]
  },
  {
    "PalabraClave": "Improcedencia Laboral, Notificación, Fraude, Diligencia",
    "Ley": "LFT",
    "Artículo": "48 Bis",
    "Texto": "Para efectos del artículo 48 de esta Ley, de manera enunciativa se considerarán actuaciones notoriamente improcedentes las siguientes:",
    "Fracciones": [
      {
        "Fracción": "I",
        "Texto": "Tratándose de las partes, abogados, litigantes, representantes o testigos:",
        "Incisos": [
          { "Inciso": "a", "Texto": "Ofrecer algún beneficio personal, dádiva o soborno a funcionarios del Centro Federal de Conciliación y Registro Laboral, Centros de Conciliación Locales o Tribunales; así como a terceros de un procedimiento laboral;" },
          { "Inciso": "b", "Texto": "Alterar un documento firmado por el trabajador con un fin distinto para incorporar la renuncia;" },
          { "Inciso": "c", "Texto": "Exigir la firma de papeles en blanco en la contratación o en cualquier momento de la relación laboral;" },
          { "Inciso": "d", "Texto": "Presentación de hechos notoriamente falsos en el juicio laboral, por cualquiera de las partes o sus representantes, sobre el salario, la jornada de trabajo o la antigüedad de la relación de trabajo;" },
          { "Inciso": "e", "Texto": "Negar el acceso a un establecimiento o centro de trabajo al actuario o notificador de la autoridad laboral, cuando éste solicite realizar una notificación o diligencia. Asimismo, negarse a recibir los documentos relativos a la notificación ordenada por la autoridad laboral cuando se trate del domicilio de la razón social o de la persona física o moral buscada. También se considera conducta infractora simular con cédulas fiscales o documentación oficial de otras razones sociales, aun cuando tengan el mismo domicilio, con objeto de evadir la citación al procedimiento de conciliación prejudicial, el emplazamiento a juicio o el desahogo de una prueba;" },
          { "Inciso": "f", "Texto": "Demandar la titularidad de un contrato colectivo de trabajo sin tener trabajadores afiliados al sindicato que labore en el centro de trabajo de cuyo contrato se reclame." }
        ]
      },
      {
        "Fracción": "II",
        "Texto": "Tratándose de servidores públicos se considerarán actuaciones notoriamente improcedentes:",
        "Incisos": [
          { "Inciso": "a", "Texto": "Levantar razón de una notificación haciendo constar que se constituyó en el domicilio que se le ordenó realizar la notificación, sin haberse constituido en el mismo;" },
          { "Inciso": "b", "Texto": "Levantar razón de una notificación o cédula de emplazamiento sin que éstas se hayan realizado;" },
          { "Inciso": "c", "Texto": "Omitir efectuar una notificación dentro del plazo establecido por la Ley u ordenado por la autoridad laboral;" },
          { "Inciso": "d", "Texto": "Dilatar de manera deliberada la notificación de una audiencia de conciliación, el emplazamiento de un juicio laboral o cualquier notificación personal del procedimiento laboral, para beneficiar a alguna de las partes del procedimiento o para recibir un beneficio de alguna de las partes;" },
          { "Inciso": "e", "Texto": "Recibir una dádiva de alguna de las partes o tercero interesado;" },
          { "Inciso": "f", "Texto": "Retrasar deliberadamente la ejecución de sentencias y convenios que sean cosa juzgada;" },
          { "Inciso": "g", "Texto": "Admitir pruebas no relacionadas con la litis que dilaten el procedimiento;" },
          { "Inciso": "h", "Texto": "Retrasar un acuerdo o resolución más de ocho días de los plazos establecidos en la ley;" },
          { "Inciso": "i", "Texto": "Ocultar expedientes con el fin de retrasar el juicio o impedir la celebración de una audiencia o diligencia;" },
          { "Inciso": "j", "Texto": "Retrasar y obstruir la entrega de la constancia de representatividad sin causa justificada;" },
          { "Inciso": "k", "Texto": "Negarse a recibir injustificadamente el trabajador de un organismo público o paraestatal una notificación de un Centro de Conciliación o un Tribunal, o bien obstaculizar su realización, en cuyo caso deberá darse vista al Órgano de Control Interno correspondiente, independientemente de las sanciones que se establecen en la presente Ley." }
        ]
      }
    ],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Define actos improcedentes en juicios laborales",
      "Incluye conductas de partes y servidores públicos",
      "Protege la integridad del procedimiento de conciliación",
      "Establece sanciones por obstrucción o simulación",
      "Refuerza la transparencia en la actuación procesal"
    ]
  },
  {
    "PalabraClave": "Reinstalación, Indemnización, Trabajador de Confianza",
    "Ley": "LFT",
    "Artículo": "49",
    "Texto": "La persona empleadora quedará eximida de la obligación de reinstalar a la persona trabajadora, mediante el pago de las indemnizaciones que se determinan en el artículo 50 en los casos siguientes:",
    "Fracciones": [
      {
        "Fracción": "I",
        "Texto": "Cuando se trate de trabajadores que tengan una antigüedad menor de un año;"
      },
      {
        "Fracción": "II",
        "Texto": "Si comprueba ante el Tribunal que el trabajador, por razón del trabajo que desempeña o por las características de sus labores, está en contacto directo y permanente con él y el Tribunal estima, tomando en consideración las circunstancias del caso, que no es posible el desarrollo normal de la relación de trabajo;"
      },
      {
        "Fracción": "III",
        "Texto": "En los casos de trabajadores de confianza;"
      },
      {
        "Fracción": "IV",
        "Texto": "En el trabajo del hogar;"
      },
      {
        "Fracción": "V",
        "Texto": "Cuando se trate de trabajadores eventuales;"
      },
      {
        "Fracción": "VI",
        "Texto": "Cuando se trate de personas trabajadoras en plataformas digitales. Únicamente procederá la reinstalación obligatoria en caso de violación a derechos colectivos, tales como la libertad de asociación, autonomía sindical, el derecho de huelga y de contratación colectiva."
      }
    ],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Establece excepciones a la reinstalación laboral",
      "Reconoce modalidades especiales como trabajo del hogar y plataformas digitales",
      "Protege derechos colectivos en entornos digitales",
      "Vincula indemnización con artículo 50",
      "Permite al empleador evitar reinstalación en casos específicos"
    ]
  },
  {
    "PalabraClave": "Indemnización Reinstalación Tiempo Determinado Digital",
    "Ley": "LFT",
    "Artículo": "50",
    "Texto": "Las indemnizaciones a que se refiere el artículo anterior consistirán:",
    "Fracciones": [
      {
        "Fracción": "I",
        "Texto": "Si la relación de trabajo fuere por tiempo determinado menor de un año, en una cantidad igual al importe de los salarios de la mitad del tiempo de servicios prestados; si excediera de un año, en una cantidad igual al importe de los salarios de seis meses por el primer año y de veinte días por cada uno de los años siguientes en que hubiese prestado sus servicios;"
      },
      {
        "Fracción": "II",
        "Texto": "Si la relación de trabajo fuere por tiempo indeterminado, la indemnización consistirá en veinte días de salario por cada uno de los años de servicios prestados;"
      },
      {
        "Fracción": "III",
        "Texto": "Además de las indemnizaciones a que se refieren las fracciones anteriores, en el importe de tres meses de salario y el pago de los salarios vencidos e intereses, en su caso, en los términos previstos en el artículo 48 de esta Ley;"
      },
      {
        "Fracción": "IV",
        "Texto": "Para las personas trabajadoras de plataformas digitales la indemnización consistirá en tres meses de salario. Adicionalmente se pagarán veinte días de salario por cada uno de los años de servicios prestados, tomando en cuenta el tiempo efectivamente laborado, como lo establece el artículo 291-D del mismo ordenamiento y los salarios vencidos e intereses, en su caso, en los términos previstos en el artículo 48 de esta Ley."
      }
    ],
    "Párrafos": [],
    "NotasOrientadoras": [
      "Detalla el cálculo de indemnizaciones según tipo de relación laboral",
      "Incluye fórmula específica para tiempo determinado y tiempo indeterminado",
      "Reconoce régimen especial para plataformas digitales",
      "Relaciona indemnización con salarios vencidos e intereses del artículo 48",
      "Integra referencia cruzada con el artículo 291-D para plataformas digitales"
    ]
  },
  {
  "PalabraClave": "Rescisión Voluntaria Causas Indemnización Dignidad",
  "Ley": "LFT",
  "Artículo": "51",
  "Texto": "Son causas de rescisión de la relación de trabajo, sin responsabilidad para el trabajador:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Engañarlo el patrón, o en su caso, la agrupación patronal al proponerle el trabajo, respecto de las condiciones del mismo. Esta causa de rescisión dejará de tener efecto después de treinta días de prestar sus servicios el trabajador;"
    },
    {
      "Fracción": "II",
      "Texto": "Incurrir el patrón, sus familiares o cualquiera de sus representantes, dentro del servicio, en faltas de probidad u honradez, actos de violencia, amenazas, injurias, hostigamiento y/o acoso sexual, malos tratamientos u otros análogos, en contra del trabajador, cónyuge, padres, hijos o hermanos;"
    },
    {
      "Fracción": "III",
      "Texto": "Incurrir el patrón, sus familiares o trabajadores, fuera del servicio, en los actos a que se refiere la fracción anterior, si son de tal manera graves que hagan imposible el cumplimiento de la relación de trabajo;"
    },
    {
      "Fracción": "IV",
      "Texto": "Reducir el patrón el salario del trabajador;"
    },
    {
      "Fracción": "V",
      "Texto": "No recibir el salario correspondiente en la fecha o lugar convenidos o acostumbrados;"
    },
    {
      "Fracción": "VI",
      "Texto": "Sufrir perjuicios causados maliciosamente por el patrón, en sus herramientas o útiles de trabajo;"
    },
    {
      "Fracción": "VII",
      "Texto": "La existencia de un peligro grave para la seguridad o salud del trabajador o de su familia, ya sea por carecer de condiciones higiénicas el establecimiento o porque no se cumplan las medidas preventivas y de seguridad que las leyes establezcan;"
    },
    {
      "Fracción": "VIII",
      "Texto": "Comprometer el patrón, con su imprudencia o descuido inexcusables, la seguridad del establecimiento o de las personas que se encuentren en él;"
    },
    {
      "Fracción": "IX",
      "Texto": "Exigir la realización de actos, conductas o comportamientos que menoscaben o atenten contra la dignidad del trabajador;"
    },
    {
      "Fracción": "X",
      "Texto": "Las análogas a las establecidas en las fracciones anteriores, de igual manera graves y de consecuencias semejantes, en lo que al trabajo se refiere."
    }
  ],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Establece causas justificadas para que el trabajador rescinda la relación laboral",
    "Protege la dignidad, seguridad y derechos del trabajador",
    "Incluye violencia, acoso, engaño, reducción salarial y condiciones insalubres",
    "Vincula con el derecho a indemnización según artículo 50"
  ]
  },
  {
  "PalabraClave": "Separación Indemnización Plazo Causas Justificadas",
  "Ley": "LFT",
  "Artículo": "52",
  "Texto": "El trabajador podrá separarse de su trabajo dentro de los treinta días siguientes a la fecha en que se dé cualquiera de las causas mencionadas en el artículo anterior y tendrá derecho a que el patrón lo indemnice en los términos del artículo 50.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Otorga al trabajador un plazo de 30 días para separarse por causas justificadas",
    "Reconoce derecho a indemnización conforme al artículo 50",
    "Conecta directamente con las causas del artículo 51",
    "Fortalece la protección del trabajador ante abusos patronales"
  ]
  },
  {
  "PalabraClave": "Terminación, relaciones laborales, causas, consentimiento, incapacidad",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "53",
  "Texto": "Son causas de terminación de las relaciones de trabajo:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "El mutuo consentimiento de las partes."
    },
    {
      "Fracción": "II",
      "Texto": "La muerte del trabajador."
    },
    {
      "Fracción": "III",
      "Texto": "La terminación de la obra o vencimiento del término o inversión del capital, de conformidad con los artículos 36, 37 y 38."
    },
    {
      "Fracción": "IV",
      "Texto": "La incapacidad física o mental o inhabilidad manifiesta del trabajador, que haga imposible la prestación del trabajo."
    },
    {
      "Fracción": "V",
      "Texto": "Los casos a que se refiere el artículo 434."
    }
  ],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo enumera las causas legales por las cuales puede concluir una relación laboral.",
    "Incluye tanto causas voluntarias como involuntarias, abarcando situaciones personales y contractuales.",
    "La fracción III remite a artículos que regulan contratos por obra, tiempo o inversión.",
    "La fracción V sugiere consultar el artículo 434 para causas específicas adicionales.",
    "Es clave para validar si una terminación laboral fue conforme a derecho."
  ]
  },
  {
  "PalabraClave": "Incapacidad, riesgo no profesional, indemnización, empleo compatible, artículo 162",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "54",
  "Texto": "En el caso de la fracción IV del artículo 53, si la incapacidad proviene de un riesgo no profesional, el trabajador tendrá derecho a que se le pague un mes de salario y doce días por cada año de servicios, de conformidad con lo dispuesto en el artículo 162, o de ser posible, si así lo desea, a que se le proporcione otro empleo compatible con sus aptitudes, independientemente de las prestaciones que le correspondan de conformidad con las leyes.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo regula las consecuencias laborales cuando la incapacidad del trabajador no proviene de un riesgo profesional.",
    "Establece una indemnización mínima: un mes de salario más doce días por cada año de servicio.",
    "Ofrece la opción de reubicación laboral si el trabajador lo desea y es viable.",
    "Remite al artículo 162 para el cálculo de la indemnización por antigüedad.",
    "Las prestaciones legales adicionales no se ven afectadas por esta disposición."
  ]
  },
  {
  "PalabraClave": "Juicio laboral, terminación injustificada, derechos del trabajador, artículo 48",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "55",
  "Texto": "Si en el juicio correspondiente no comprueba el patrón las causas de la terminación, tendrá el trabajador los derechos consignados en el artículo 48.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo establece que el patrón debe probar las causas de la terminación en juicio.",
    "Si no lo hace, el trabajador conserva los derechos establecidos en el artículo 48.",
    "Protege al trabajador frente a despidos injustificados o sin causa comprobada.",
    "El artículo 48 regula las indemnizaciones y reinstalación en caso de despido injustificado.",
    "Es clave para garantizar la equidad procesal en conflictos laborales."
  ]
  },
  {
  "PalabraClave": "Igualdad sustantiva, condiciones de trabajo, no discriminación, equidad laboral",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "56",
  "Texto": "Las condiciones de trabajo basadas en el principio de igualdad sustantiva entre mujeres y hombres en ningún caso podrán ser inferiores a las fijadas en esta Ley y deberán ser proporcionales a la importancia de los servicios e iguales para trabajos iguales, sin que puedan establecerse diferencias y/o exclusiones por motivo de origen étnico o nacionalidad, sexo, género, edad, discapacidad, condición social, condiciones de salud, religión, opiniones, preferencias sexuales, condiciones de embarazo, responsabilidades familiares o estado civil, salvo las modalidades expresamente consignadas en esta Ley.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo garantiza la igualdad sustantiva en condiciones laborales entre mujeres y hombres.",
    "Prohíbe cualquier tipo de discriminación por motivos personales, sociales o de salud.",
    "Las condiciones deben ser proporcionales a la importancia del trabajo y equitativas entre puestos equivalentes.",
    "Reconoce excepciones solo cuando están expresamente previstas en la Ley.",
    "Es clave para la protección de derechos laborales con enfoque de inclusión."
  ]
  },
  {
  "PalabraClave": "Labores conexas, tareas complementarias, compensación salarial, contratos laborales",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "56 Bis",
  "Texto": "Los trabajadores podrán desempeñar labores o tareas conexas o complementarias a su labor principal, por lo cual podrán recibir la compensación salarial correspondiente.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Para los efectos del párrafo anterior, se entenderán como labores o tareas conexas o complementarias, aquellas relacionadas permanente y directamente con las que estén pactadas en los contratos individuales y colectivos de trabajo o, en su caso, las que habitualmente realice el trabajador."
    }
  ],
  "NotasOrientadoras": [
    "Este artículo permite que el trabajador realice tareas adicionales relacionadas con su labor principal.",
    "Reconoce el derecho a recibir compensación por dichas tareas.",
    "Define como conexas o complementarias aquellas pactadas en contrato o realizadas habitualmente.",
    "Fortalece la flexibilidad laboral sin vulnerar derechos salariales.",
    "Es útil para interpretar funciones extendidas dentro de un mismo puesto."
  ]
  },
  {
  "PalabraClave": "Modificación de condiciones, salario no remunerador, jornada excesiva, circunstancias económicas",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "57",
  "Texto": "El trabajador podrá solicitar al Tribunal la modificación de las condiciones de trabajo, cuando el salario no sea remunerador o sea excesiva la jornada de trabajo o concurran circunstancias económicas que la justifiquen.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "El patrón podrá solicitar la modificación cuando concurran circunstancias económicas que la justifiquen."
    }
  ],
  "NotasOrientadoras": [
    "Este artículo permite al trabajador solicitar ajustes en sus condiciones laborales ante el Tribunal.",
    "Reconoce causas como salario insuficiente, jornada excesiva o factores económicos.",
    "También otorga al patrón la facultad de solicitar modificaciones por razones económicas.",
    "Establece un mecanismo formal para equilibrar necesidades laborales y empresariales.",
    "Es clave para la negociación y revisión de condiciones laborales en contextos cambiantes."
  ]
  },
  {
  "PalabraClave": "Jornada laboral, disposición, tiempo de trabajo, patrón, trabajador",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "58",
  "Texto": "Jornada de trabajo es el tiempo durante el cual el trabajador está a disposición del patrón para prestar su trabajo.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Define el concepto de jornada laboral como el tiempo en que el trabajador está disponible para el patrón.",
    "Es la base para delimitar derechos y obligaciones en materia de tiempo de trabajo.",
    "No establece duración específica, pero sirve como marco para los artículos siguientes.",
    "Es clave para interpretar límites legales y responsabilidades durante la jornada.",
    "Aplica a todos los tipos de jornada: diurna, nocturna y mixta."
  ]
  },
  {
  "PalabraClave": "Duración de jornada, distribución de horas, descanso sabatino, acuerdo laboral",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "59",
  "Texto": "El trabajador y el patrón fijarán la duración de la jornada de trabajo, sin que pueda exceder los máximos legales.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Los trabajadores y el patrón podrán repartir las horas de trabajo, a fin de permitir a los primeros el reposo del sábado en la tarde o cualquier modalidad equivalente."
    }
  ],
  "NotasOrientadoras": [
    "Este artículo permite que la duración de la jornada se acuerde entre trabajador y patrón.",
    "Establece como límite los máximos legales definidos en otros artículos.",
    "El segundo párrafo habilita la redistribución de horas para facilitar el descanso sabatino.",
    "Reconoce modalidades flexibles siempre que respeten los derechos laborales.",
    "Es útil para diseñar esquemas de trabajo adaptados a necesidades individuales o colectivas."
  ]
  },
  {
  "PalabraClave": "Jornada diurna, jornada nocturna, jornada mixta, horario laboral, Jornadas de trabajo",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "60",
  "Texto": "Jornada diurna es la comprendida entre las seis y las veinte horas.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Jornada nocturna es la comprendida entre las veinte y las seis horas."
    },
    {
      "Párrafo": "3",
      "Texto": "Jornada mixta es la que comprende períodos de tiempo de las jornadas diurna y nocturna, siempre que el período nocturno sea menor de tres horas y media, pues si comprende tres y media o más, se reputará jornada nocturna."
    }
  ],
  "NotasOrientadoras": [
    "Este artículo clasifica las jornadas laborales en diurna, nocturna y mixta según el horario.",
    "La jornada diurna abarca de 6:00 a 20:00 horas; la nocturna, de 20:00 a 6:00.",
    "La jornada mixta combina ambos períodos, pero se considera nocturna si el tramo nocturno supera las 3.5 horas.",
    "Esta clasificación es clave para determinar límites legales, pagos y derechos laborales.",
    "Sirve como base para aplicar disposiciones específicas sobre duración, descansos y compensaciones."
  ]
  },
  {
  "PalabraClave": "Duración máxima, jornada diurna, jornada nocturna, jornada mixta, límites legales",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "61",
  "Texto": "La duración máxima de la jornada será: ocho horas la diurna, siete la nocturna y siete horas y media la mixta.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo establece los límites máximos de duración para cada tipo de jornada laboral.",
    "La jornada diurna no debe exceder ocho horas; la nocturna, siete; y la mixta, siete horas y media.",
    "Sirve como base para determinar jornadas legales y evitar abusos en el tiempo de trabajo.",
    "Es clave para calcular horas extras y validar cumplimiento normativo.",
    "Complementa la clasificación del artículo 60."
  ]
  },
  {
  "PalabraClave": "Fijación de jornada, artículo 5, fracción III, contrato laboral, límites legales",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "62",
  "Texto": "Para fijar la jornada de trabajo se observará lo dispuesto en el artículo 5o., fracción III.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo remite al artículo 5, fracción III, como base para establecer la jornada laboral.",
    "La fijación debe respetar los principios legales y contractuales establecidos.",
    "Es una norma de referencia que vincula la jornada con el objeto lícito del trabajo.",
    "Garantiza que la jornada se pacte conforme a derecho.",
    "Debe interpretarse junto con los artículos 58 a 61."
  ]
  },
  {
  "PalabraClave": "Descanso laboral, jornada continua, media hora, derecho del trabajador",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "63",
  "Texto": "Durante la jornada continua de trabajo se concederá al trabajador un descanso de media hora, por lo menos.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo establece el derecho del trabajador a un descanso mínimo dentro de la jornada continua.",
    "La duración mínima del descanso es de media hora.",
    "Aplica a jornadas sin interrupciones prolongadas.",
    "Es clave para preservar la salud y eficiencia del trabajador.",
    "Debe respetarse incluso en esquemas flexibles o intensivos."
  ]
  },
  {
  "PalabraClave": "Tiempo efectivo, reposo, comida, jornada laboral, permanencia en el lugar de trabajo",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "64",
  "Texto": "Cuando el trabajador no pueda salir del lugar donde presta sus servicios durante las horas de reposo o de comidas, el tiempo correspondiente le será computado como tiempo efectivo de la jornada de trabajo.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo reconoce como tiempo efectivo las horas de reposo o comida si el trabajador no puede salir del lugar de trabajo.",
    "Protege al trabajador en situaciones de confinamiento laboral.",
    "Evita que se descuenten injustamente tiempos que siguen bajo disposición del patrón.",
    "Es clave para calcular correctamente la jornada y las horas extras.",
    "Complementa el artículo 63 sobre descansos."
  ]
  },
  {
  "PalabraClave": "Prolongación de jornada, siniestro, riesgo inminente, protección, emergencia laboral",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "65",
  "Texto": "En los casos de siniestro o riesgo inminente en que peligre la vida del trabajador, de sus compañeros o del patrón, o la existencia misma de la empresa, la jornada de trabajo podrá prolongarse por el tiempo estrictamente indispensable para evitar esos males.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo permite extender la jornada en casos de emergencia o peligro grave.",
    "La prolongación debe ser estrictamente indispensable y limitada al riesgo.",
    "Protege la vida, integridad y continuidad de la empresa.",
    "No autoriza extensiones arbitrarias ni permanentes.",
    "Debe aplicarse con criterio proporcional y temporal."
  ]
  },
  {
  "PalabraClave": "Horas extraordinarias, prolongación de jornada, límite semanal, trabajo adicional",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "66",
  "Texto": "Podrá también prolongarse la jornada de trabajo por circunstancias extraordinarias, sin exceder nunca de tres horas diarias ni de tres veces en una semana.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo regula la extensión de la jornada por causas extraordinarias.",
    "Establece un límite de tres horas diarias y tres veces por semana.",
    "Protege al trabajador frente a abusos en la asignación de horas extras.",
    "Debe aplicarse con justificación y respetando los topes legales.",
    "Complementa el artículo 67 sobre pago de horas extraordinarias."
  ]
  },
  {
  "PalabraClave": "Pago de horas, jornada extraordinaria, salario adicional, emergencia, compensación",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "67",
  "Texto": "Las horas de trabajo a que se refiere el artículo 65, se retribuirán con una cantidad igual a la que corresponda a cada una de las horas de la jornada.",
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Las horas de trabajo extraordinario se pagarán con un ciento por ciento más del salario que corresponda a las horas de la jornada."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Este artículo distingue entre el pago por horas en casos de emergencia (artículo 65) y el pago por horas extraordinarias regulares.",
    "Las horas por siniestro se pagan al salario normal; las extraordinarias, con un 100% adicional.",
    "Establece criterios claros para calcular compensaciones según el tipo de prolongación.",
    "Es clave para evitar confusiones entre jornada extendida por riesgo y jornada extendida por necesidad extraordinaria.",
    "Complementa los artículos 65 y 66 en materia de duración y pago."
  ]
  },
  {
  "PalabraClave": "Límite semanal, obligación del trabajador, sanción al patrón, exceso de jornada, pago doble",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "68",
  "Texto": "Los trabajadores no están obligados a prestar sus servicios por un tiempo mayor del permitido de este capítulo.",
  "Párrafos": [
    {
      "Párrafo" : "2",
      "Texto": "La prolongación del tiempo extraordinario que exceda de nueve horas a la semana, obliga al patrón a pagar al trabajador el tiempo excedente con un doscientos por ciento más del salario que corresponda a las horas de la jornada, sin perjuicio de las sanciones establecidas en esta Ley."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Este artículo protege al trabajador frente a abusos en la extensión de jornada.",
    "Establece un límite máximo de nueve horas extraordinarias por semana.",
    "El exceso se paga con un 200% adicional y puede generar sanciones al patrón.",
    "Refuerza el carácter voluntario de las horas extraordinarias.",
    "Es fundamental para auditar cumplimiento y evitar prácticas laborales ilegales."
  ]
  },
  {
  "PalabraClave": "Descanso semanal, seis días, salario íntegro, derecho laboral, jornada",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "69",
  "Texto": "Por cada seis días de trabajo disfrutará el trabajador de un día de descanso, por lo menos, con goce de salario íntegro.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo garantiza al trabajador un día de descanso por cada seis días laborados.",
    "El descanso debe otorgarse con salario íntegro, sin descuentos.",
    "Es un derecho irrenunciable vinculado a la salud y recuperación del trabajador.",
    "Sirve como base para calcular semanas laborales completas.",
    "Complementa los artículos 70 y 71 sobre organización del descanso."
  ]
  },
  {
  "PalabraClave": "Labor continua, acuerdo, descanso semanal, patrón, trabajador",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "70",
  "Texto": "En los trabajos que requieran una labor continua, los trabajadores y el patrón fijarán de común acuerdo los días en que los trabajadores deban disfrutar de los de descanso semanal.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo permite flexibilidad en la asignación de días de descanso en labores continuas.",
    "El acuerdo entre patrón y trabajadores es obligatorio para definir los días.",
    "Evita interrupciones en procesos productivos sin vulnerar derechos.",
    "Debe respetar el principio de descanso semanal establecido en el artículo 69.",
    "Es clave en industrias como salud, transporte o manufactura continua."
  ]
  },
  {
  "PalabraClave": "Descanso dominical, reglamento, prima dominical, veinticinco por ciento, día domingo",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "71",
  "Texto": "En los reglamentos de esta Ley se procurará que el día de descanso semanal sea el domingo.",
  "Párrafos": [
    {
      "Párrafo" : "2",
      "Texto": "Los trabajadores que presten servicio en día domingo tendrán derecho a una prima adicional de un veinticinco por ciento, por lo menos, sobre el salario de los días ordinarios de trabajo."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Este artículo establece preferencia por el domingo como día de descanso.",
    "Si se trabaja en domingo, se debe pagar una prima dominical del 25% como mínimo.",
    "La prima se calcula sobre el salario ordinario del trabajador.",
    "Es una compensación por laborar en día tradicionalmente destinado al descanso.",
    "Complementa los artículos 69 y 73 en materia de descanso y compensación."
  ]
  },
{
  "PalabraClave": "Pago proporcional, descanso, varios patrones, semana incompleta, salario",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "72",
  "Texto": "Cuando el trabajador no preste sus servicios durante todos los días de trabajo de la semana, o cuando en el mismo día o en la misma semana preste sus servicios a varios patrones, tendrá derecho a que se le pague la parte proporcional del salario de los días de descanso, calculada sobre el salario de los días en que hubiese trabajado o sobre el que hubiese percibido de cada patrón.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo regula el pago proporcional del descanso cuando el trabajador no labora toda la semana.",
    "También aplica si trabaja para varios patrones en la misma semana.",
    "El cálculo se basa en el salario percibido por los días efectivamente trabajados.",
    "Evita que el trabajador pierda el derecho al descanso por esquemas flexibles o múltiples empleadores.",
    "Es clave para sistemas de contratación parcial o por jornada."
  ]
  },
{
  "PalabraClave": "Prohibición, descanso obligatorio, salario doble, servicio en descanso, compensación",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "73",
  "Texto": "Los trabajadores no están obligados a prestar servicios en sus días de descanso.",
  "Párrafos": [
    {
      
      "Párrafo" : "2",
      "Texto": "Si se quebranta esta disposición, el patrón pagará al trabajador, independientemente del salario que le corresponda por el descanso, un salario doble por el servicio prestado."
    }
  ],
  "Fracciones": [],
  "NotasOrientadoras": [
    "Este artículo prohíbe obligar al trabajador a laborar en sus días de descanso.",
    "Si se vulnera esta norma, el patrón debe pagar salario doble adicional al salario por el descanso.",
    "Protege el derecho al descanso como parte esencial de la jornada laboral.",
    "Establece una sanción económica directa por incumplimiento.",
    "Complementa los artículos 69 y 71 en materia de descanso y compensación."
  ]
  },
  {
  "PalabraClave": "Descanso obligatorio, días festivos, jornada electoral, transmisión de poder, Prestacion en dias festivos",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "74",
  "Texto": "Son días de descanso obligatorio:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "El 1o. de enero."
    },
    {
      "Fracción": "II",
      "Texto": "El primer lunes de febrero en conmemoración del 5 de febrero."
    },
    {
      "Fracción": "III",
      "Texto": "El tercer lunes de marzo en conmemoración del 21 de marzo."
    },
    {
      "Fracción": "IV",
      "Texto": "El 1o. de mayo."
    },
    {
      "Fracción": "V",
      "Texto": "El 16 de septiembre."
    },
    {
      "Fracción": "VI",
      "Texto": "El tercer lunes de noviembre en conmemoración del 20 de noviembre."
    },
    {
      "Fracción": "VII",
      "Texto": "El 1o. de octubre de cada seis años, cuando corresponda a la transmisión del Poder Ejecutivo Federal."
    },
    {
      "Fracción": "VIII",
      "Texto": "El 25 de diciembre."
    },
    {
      "Fracción": "IX",
      "Texto": "El que determinen las leyes federales y locales electorales, en el caso de elecciones ordinarias, para efectuar la jornada electoral."
    }
  ],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo establece los días de descanso obligatorio en México, aplicables a todos los trabajadores.",
    "Incluye fechas históricas, cívicas y religiosas, así como eventos institucionales como elecciones y transmisión de poder.",
    "Algunos días se trasladan al lunes más cercano para facilitar el descanso continuo.",
    "El descanso obligatorio implica goce de salario íntegro y, si se labora, genera derecho a pago doble.",
    "Es clave para la planificación laboral, el cumplimiento normativo y la conciliación entre vida personal y trabajo."
  ]
  },
  {
  "PalabraClave": "Prestación en días festivos, salario doble, convenio laboral, tribunal, descanso obligatorio",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "75",
  "Texto": "En los casos del artículo 74 los trabajadores y los patrones determinarán el número de trabajadores que deban prestar sus servicios. Si no se llega a un convenio, resolverá el Tribunal.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Los trabajadores quedarán obligados a prestar los servicios y tendrán derecho a que se les pague, independientemente del salario que les corresponda por el descanso obligatorio, un salario doble por el servicio prestado."
    }
  ],
  "NotasOrientadoras": [
    "Este artículo complementa el artículo 74, regulando la ejecución del trabajo en días de descanso obligatorio.",
    "El primer párrafo establece el mecanismo de acuerdo entre trabajadores y patrones para definir quién labora.",
    "El segundo párrafo garantiza el derecho al pago doble por el servicio prestado, además del salario por el descanso.",
    "Si no hay acuerdo entre las partes, el Tribunal interviene para resolver.",
    "Es clave para asegurar justicia laboral en jornadas excepcionales y evitar abusos en días festivos."
  ]
  },
  {
  "PalabraClave": "Vacaciones, incremento progresivo, derechos laborales",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "76",
  "Texto": "Las personas trabajadoras que tengan más de un año de servicios disfrutarán de un periodo anual de vacaciones pagadas, que en ningún caso podrá ser inferior a doce días laborables, y que aumentará en dos días laborables, hasta llegar a veinte, por cada año subsecuente de servicios.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "A partir del sexto año, el periodo de vacaciones aumentará en dos días por cada cinco de servicios."
    }
  ],
  "NotasOrientadoras": [
    "Este artículo establece el derecho mínimo a vacaciones pagadas para personas trabajadoras con más de un año de antigüedad.",
    "El periodo inicia en 12 días y aumenta progresivamente hasta 20, por cada año subsecuente.",
    "A partir del sexto año, el incremento se ajusta a un ritmo quinquenal.",
    "Es clave para la planeación de descansos prolongados y la retención laboral.",
    "Refleja una política de bienestar y reconocimiento por antigüedad."
  ]
  },
  {
  "PalabraClave": "Servicios discontinuos, trabajadores de temporada, vacaciones, derechos laborales",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "77",
  "Texto": "Los trabajadores que presten servicios discontinuos y los de temporada tendrán derecho a un período anual de vacaciones, en proporción al número de días de trabajos en el año.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Reconoce el derecho a vacaciones para trabajadores con jornadas no continuas o estacionales.",
    "El cálculo se realiza proporcionalmente al tiempo efectivamente trabajado.",
    "Evita exclusión de derechos por modalidad de contratación.",
    "Es relevante para sectores agrícolas, turísticos y eventuales.",
    "Fortalece la equidad en el acceso a beneficios laborales."
  ]
  },
  {
  "PalabraClave": "Vacaciones continuas, distribución libre, potestad del trabajador, artículo 76, descanso anual",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "78",
  "Texto": "Del total del periodo que le corresponda conforme a lo previsto en el artículo 76 de esta Ley, la persona trabajadora disfrutará de doce días de vacaciones continuos, por lo menos. Dicho periodo, a potestad de la persona trabajadora podrá ser distribuido en la forma y tiempo que así lo requiera.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Garantiza al menos 12 días de vacaciones continuas, como derecho mínimo.",
    "Otorga flexibilidad al trabajador para distribuir el resto del periodo.",
    "Refuerza la autonomía y conciliación entre vida personal y laboral.",
    "Complementa el artículo 76, enfocándose en el disfrute efectivo.",
    "Es útil para planificar descansos escalonados o estratégicos."
  ]
  },
  {
  "PalabraClave": "Vacaciones, remuneración proporcional, terminación laboral, compensación, derechos adquiridos",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "79",
  "Texto": "Las vacaciones no podrán compensarse con una remuneración.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Si la relación de trabajo termina antes de que se cumpla el año de servicios, el trabajador tendrá derecho a una remuneración proporcionada al tiempo de servicios prestados."
    }
  ],
  "NotasOrientadoras": [
    "Prohíbe sustituir el descanso vacacional por pago económico, salvo en caso de terminación laboral.",
    "Reconoce el derecho proporcional a vacaciones si el vínculo laboral se extingue antes del año.",
    "Protege el descanso como derecho irrenunciable.",
    "Evita prácticas que desincentiven el disfrute efectivo del tiempo libre.",
    "Es clave para liquidaciones y finiquitos justos."
  ]
  },
  {
  "PalabraClave": "Prima vacacional, veinticinco por ciento, salario adicional, vacaciones, compensación económica",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "80",
  "Texto": "Los trabajadores tendrán derecho a una prima no menor de veinticinco por ciento sobre los salarios que les correspondan durante el período de vacaciones.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Establece el derecho a una prima adicional durante el periodo vacacional.",
    "La prima mínima es del 25% sobre el salario correspondiente.",
    "Reconoce el esfuerzo laboral y fomenta el descanso digno.",
    "Debe calcularse junto con el salario base en vacaciones.",
    "Es relevante para nóminas, contratos y conciliaciones laborales."
  ]
  },
  {
  "PalabraClave": "Vacaciones, seis meses, constancia de antigüedad, periodo vacacional, cumplimiento anual",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "81",
  "Texto": "Las vacaciones deberán concederse a los trabajadores dentro de los seis meses siguientes al cumplimiento del año de servicios. Los patrones entregarán anualmente a sus trabajadores una constancia que contenga su antigüedad y de acuerdo con ella el período de vacaciones que les corresponda y la fecha en que deberán disfrutarlo.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Establece un plazo máximo de seis meses para otorgar vacaciones tras cumplir el año de servicios.",
    "Obliga a los patrones a entregar constancia anual de antigüedad y periodo vacacional.",
    "Facilita la planeación y transparencia en el disfrute de vacaciones.",
    "Evita retrasos o acumulaciones indebidas de descansos.",
    "Es útil para auditorías laborales y gestión de recursos humanos."
  ]
  },
  {
  "PalabraClave": "Salario, retribución",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "82",
  "Texto": "Salario es la retribución que debe pagar el patrón al trabajador por su trabajo.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo define el salario como la contraprestación económica por el trabajo realizado.",
    "Establece la base jurídica para todos los derechos derivados del pago laboral.",
    "Es el punto de partida para entender modalidades, cálculo y protección del ingreso.",
    "Aplica a todas las formas de contratación reconocidas por la Ley.",
    "Fundamental para interpretar obligaciones del patrón y derechos del trabajador."
  ]
  },
  {
  "PalabraClave": "Unidad de tiempo, unidad de obra, comisión, precio alzado, salario",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "83",
  "Texto": "El salario puede fijarse por unidad de tiempo, por unidad de obra, por comisión, a precio alzado o de cualquier otra manera.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Tratándose de salario por unidad de tiempo, se establecerá específicamente esa naturaleza. El trabajador y el patrón podrán convenir el monto, siempre que se trate de un salario remunerador, así como el pago por cada hora de prestación de servicio, siempre y cuando no se exceda la jornada máxima legal y se respeten los derechos laborales y de seguridad social que correspondan a la plaza de que se trate. El ingreso que perciban los trabajadores por esta modalidad, en ningún caso será inferior al que corresponda a una jornada diaria."
    },
    {
      "Párrafo": "3",
      "Texto": "Cuando el salario se fije por unidad de obra, además de especificarse la naturaleza de ésta, se hará constar la cantidad y calidad del material, el estado de la herramienta y útiles que el patrón, en su caso, proporcione para ejecutar la obra, y el tiempo por el que los pondrá a disposición del trabajador, sin que pueda exigir cantidad alguna por concepto del desgaste natural que sufra la herramienta como consecuencia del trabajo."
    }
  ],
  "NotasOrientadoras": [
    "Este artículo permite diversas formas de fijación del salario: por tiempo, obra, comisión, precio alzado, entre otras.",
    "El segundo párrafo regula el salario por hora, exigiendo que sea remunerador y respetuoso de la jornada máxima legal.",
    "El tercer párrafo establece condiciones claras para el salario por unidad de obra, incluyendo materiales y herramientas.",
    "Protege al trabajador frente a prácticas abusivas en modalidades flexibles de pago.",
    "Es clave para contratos individuales, colectivos y esquemas especiales de remuneración."
  ]
  },  
  {
  "PalabraClave": "Integración de salario, prestaciones, efectivo, especie",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "84",
  "Texto": "El salario se integra con los pagos hechos en efectivo por cuota diaria, gratificaciones, percepciones, habitación, primas, comisiones, prestaciones en especie y cualquiera otra cantidad o prestación que se entregue al trabajador por su trabajo.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo define los componentes que integran el salario, incluyendo pagos en efectivo y en especie.",
    "Reconoce que el salario no se limita a la cuota diaria, sino que incluye otras percepciones laborales.",
    "Es clave para calcular prestaciones, indemnizaciones y obligaciones fiscales.",
    "Permite identificar qué conceptos deben considerarse para efectos de seguridad social.",
    "Fundamental para evitar simulaciones o exclusiones indebidas en el pago al trabajador."
  ]
  },
  {
  "PalabraClave": "Salario mínimo, remunerador, unidad de obra",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "85",
  "Texto": "El salario debe ser remunerador y nunca menor al fijado como mínimo de acuerdo con las disposiciones de esta Ley. Para fijar el importe del salario se tomarán en consideración la cantidad y calidad del trabajo.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "En el salario por unidad de obra, la retribución que se pague será tal, que para un trabajo normal, en una jornada de ocho horas, dé por resultado el monto del salario mínimo, por lo menos."
    }
  ],
  "NotasOrientadoras": [
    "Este artículo garantiza que el salario sea suficiente y nunca inferior al mínimo legal.",
    "Obliga a considerar la cantidad y calidad del trabajo al fijar el monto.",
    "El segundo párrafo protege al trabajador en esquemas por unidad de obra, asegurando que el pago equivalga al salario mínimo.",
    "Es esencial para contratos flexibles y para evitar abusos en jornadas extendidas.",
    "Refuerza el principio de salario digno como eje de la relación laboral."
  ]
  },
  {
  "PalabraClave": "Igualdad salarial, género, eficiencia, jornada, puesto",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "86",
  "Texto": "A trabajo igual, desempeñado en puesto, jornada y condiciones de eficiencia también iguales, debe corresponder salario igual; en cumplimiento de las obligaciones del Estado de reducir la brecha salarial de género se promoverán acciones para erradicar las prácticas retributivas desiguales de conformidad con lo dispuesto en la Ley General para la Igualdad entre Mujeres y Hombres.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Este artículo consagra el principio de igualdad salarial ante condiciones laborales equivalentes.",
    "Reconoce la obligación del Estado de reducir la brecha salarial de género.",
    "Vincula la Ley Federal del Trabajo con la Ley General para la Igualdad entre Mujeres y Hombres.",
    "Es clave para auditorías de equidad, políticas de inclusión y litigios por discriminación.",
    "Princpio rector, igualdad salarial."
  ]
  },
  {
  "PalabraClave": "Aguinaldo, proporcional, diciembre, derecho anual",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "87",
  "Texto": "Los trabajadores tendrán derecho a un aguinaldo anual que deberá pagarse antes del día veinte de diciembre, equivalente a quince días de salario, por lo menos.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "Los que no hayan cumplido el año de servicios, independientemente de que se encuentren laborando o no en la fecha de liquidación del aguinaldo, tendrán derecho a que se les pague la parte proporcional del mismo, conforme al tiempo que hubieren trabajado, cualquiera que fuere éste."
    }
  ],
  "NotasOrientadoras": [
    "Establece el derecho universal al aguinaldo como prestación anual mínima.",
    "Fija el plazo límite para su pago: antes del 20 de diciembre.",
    "Reconoce el derecho proporcional para quienes no hayan cumplido el año de servicios.",
    "Aplica incluso si el trabajador ya no está laborando al momento del pago.",
    "**Principio rector: Derecho irrenunciable a prestaciones mínimas proporcionales.**"
  ]
  },
  {
  "PalabraClave": "Plazos, pago, salario, trabajo material, quincenal",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "88",
  "Texto": "Los plazos para el pago del salario nunca podrán ser mayores de una semana para las personas que desempeñan un trabajo material y de quince días para los demás trabajadores.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Establece límites temporales para el pago del salario según el tipo de trabajo.",
    "Protege a los trabajadores manuales con pagos más frecuentes (semanales).",
    "Evita retrasos excesivos que afecten la subsistencia del trabajador.",
    "Sirve como base para auditorías laborales y cumplimiento patronal.",
    "**Principio rector: Oportunidad en el pago como garantía de subsistencia.**"
  ]
  },
  {
  "PalabraClave": "Indemnización, salario diario, unidad de obra, cálculo",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "89",
  "Texto": "Para determinar el monto de las indemnizaciones que deban pagarse a los trabajadores se tomará como base el salario correspondiente al día en que nazca el derecho a la indemnización, incluyendo en él la cuota diaria y la parte proporcional de las prestaciones mencionadas en el artículo 84.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "En los casos de salario por unidad de obra, y en general, cuando la retribución sea variable, se tomará como salario diario el promedio de las percepciones obtenidas en los treinta días efectivamente trabajados antes del nacimiento del derecho. Si en ese lapso hubiese habido aumento en el salario, se tomará como base el promedio de las percepciones obtenidas por el trabajador a partir de la fecha del aumento."
    },
    {
      "Párrafo": "3",
      "Texto": "Cuando el salario se fije por semana o por mes, se dividirá entre siete o entre treinta, según el caso, para determinar el salario diario."
    }
  ],
  "NotasOrientadoras": [
    "Establece cómo calcular el salario base para indemnizaciones, incluyendo prestaciones proporcionales.",
    "Reconoce modalidades variables como unidad de obra y ajusta el cálculo al promedio de los últimos 30 días trabajados.",
    "Considera aumentos recientes en el salario para evitar perjuicios al trabajador.",
    "Define reglas claras para convertir salarios semanales o mensuales en salario diario.",
    "**Principio rector: Equidad en el cálculo indemnizatorio conforme al salario real percibido.**"
  ]
  },
  {
  "PalabraClave": "Salario mínimo, necesidades básicas, inflación, utilidad social",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "90",
  "Texto": "Salario mínimo es la cantidad menor que debe recibir en efectivo la persona trabajadora por los servicios prestados en una jornada de trabajo.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "El salario mínimo deberá ser suficiente para satisfacer las necesidades normales de una o un jefe de familia en el orden material, social y cultural, y para proveer a la educación obligatoria de las y los hijos."
    },
    {
      "Párrafo": "3",
      "Texto": "Se considera de utilidad social el establecimiento de instituciones y medidas que protejan la capacidad adquisitiva del salario y faciliten el acceso de toda persona trabajadora a la obtención de satisfactores."
    },
    {
      "Párrafo": "4",
      "Texto": "La fijación anual de los salarios mínimos, o la revisión de los mismos, nunca estará por debajo de la inflación observada durante el periodo de su vigencia transcurrido."
    }
  ],
  "NotasOrientadoras": [
    "Define el salario mínimo como el umbral mínimo de pago por jornada laboral.",
    "Establece que debe cubrir necesidades materiales, sociales, culturales y educativas.",
    "Reconoce la utilidad social de proteger el poder adquisitivo del salario.",
    "Obliga a que su revisión anual nunca esté por debajo de la inflación observada.",
    "**Principio rector: Garantía constitucional de suficiencia y protección del salario mínimo.**"
  ]
  },
  {
  "PalabraClave": "Salario mínimo, salario minimo general, profesional, oficios",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "91",
  "Texto": "Los salarios mínimos podrán ser generales para una o varias áreas geográficas de aplicación, que pueden extenderse a una o más entidades federativas o profesionales, para una rama determinada de la actividad económica o para profesiones, oficios o trabajos especiales, dentro de una o varias áreas geográficas.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Distingue entre salarios mínimos generales y profesionales según el tipo de actividad.",
    "Permite aplicar salarios mínimos diferenciados por región o especialidad.",
    "Facilita la adaptación del salario mínimo a condiciones locales o sectoriales.",
    "**Principio rector: Flexibilidad territorial y profesional en la fijación del salario mínimo.**"
  ]
  },
  {
  "PalabraClave": "Salario mínimo general",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "92",
  "Texto": "Los salarios mínimos generales regirán para todos los trabajadores del área o áreas geográficas de aplicación que se determinen, independientemente de las ramas de la actividad económica, profesiones, oficios o trabajos especiales.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Establece que el salario mínimo general aplica a todos los trabajadores de una zona.",
    "No distingue entre profesiones u oficios para su aplicación.",
    "Garantiza una base mínima común en cada área geográfica.",
    "Evita exclusiones injustificadas en la protección salarial.",
    "**Principio rector: Universalidad del salario mínimo general por zona.**"
  ]
  },
  {
  "PalabraClave": "Salario mínimo profesional, ramas económicas, oficios, zonas",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "93",
  "Texto": "Los salarios mínimos profesionales regirán para todos los trabajadores de las ramas de actividad económica, profesiones, oficios o trabajos especiales que se determinen dentro de una o varias áreas geográficas de aplicación.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Aplica a trabajadores con funciones específicas dentro de ramas económicas definidas.",
    "Permite establecer mínimos diferenciados por especialidad u oficio.",
    "Reconoce el valor técnico o especializado de ciertas actividades.",
    "Complementa el salario mínimo general con criterios profesionales.",
    "**Principio rector: Reconocimiento del valor profesional en la protección salarial.**"
  ]
  },
  {
  "PalabraClave": "Comisión Nacional, fijación de salario mínimo",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "94",
  "Texto": "Los salarios mínimos se fijarán por una Comisión Nacional integrada por representantes de los trabajadores, de los patrones y del gobierno, la cual podrá auxiliarse de las comisiones especiales de carácter consultivo que considere indispensables para el mejor desempeño de sus funciones.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Establece el órgano responsable de fijar los salarios mínimos.",
    "Garantiza representación tripartita: trabajadores, patrones y gobierno.",
    "Permite apoyo técnico mediante comisiones consultivas.",
    "Asegura que la fijación se base en criterios técnicos y sociales.",
    "**Principio rector: Participación tripartita en la determinación del salario mínimo.**"
  ]
  },
  {
  "PalabraClave": "Comisión Nacional, Comisiones Consultivas, integración tripartita",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "95",
  "Texto": "La Comisión Nacional de los Salarios Mínimos y las Comisiones Consultivas se integrarán en forma tripartita, de acuerdo a lo establecido por el Capítulo II del Título Trece de esta Ley.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Confirma la estructura tripartita de los órganos encargados del salario mínimo.",
    "Vincula su integración con disposiciones específicas del Título Trece.",
    "Refuerza la legitimidad de las decisiones tomadas por estas comisiones.",
    "Permite equilibrio entre intereses laborales, empresariales y estatales.",
    "**Principio rector: Equilibrio institucional en la política salarial mínima.**"
  ]
  },
  {
  "PalabraClave": "Áreas geográficas, municipios, salario mínimo, continuidad territorial",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "96",
  "Texto": "La Comisión Nacional determinará la división de la República en áreas geográficas, las que estarán constituidas por uno o más municipios en los que deba regir un mismo salario mínimo general, sin que necesariamente exista continuidad territorial entre dichos municipios.",
  "Fracciones": [],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Faculta a la Comisión Nacional para definir zonas salariales.",
    "Permite agrupar municipios sin necesidad de continuidad territorial.",
    "Reconoce diferencias económicas y sociales entre regiones.",
    "Optimiza la aplicación del salario mínimo según condiciones locales.",
    "**Principio rector: Adaptabilidad territorial en la política salarial mínima.**"
  ]
  },
  {
  "PalabraClave": "Descuentos en salarios, pensión alimenticia, vivienda, créditos",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "97",
  "Texto": "Los salarios mínimos no podrán ser objeto de compensación, descuento o reducción, salvo en los casos siguientes:",
  "Fracciones": [
    {
      "Fracción": "I",
      "Texto": "Pensiones alimenticias decretadas por la autoridad competente en favor de las personas mencionadas en el artículo 110, fracción V."
    },
    {
      "Fracción": "II",
      "Texto": "Pago de rentas a que se refiere el artículo 151. Este descuento no podrá exceder del diez por ciento del salario."
    },
    {
      "Fracción": "III",
      "Texto": "Pago de abonos para cubrir préstamos o rentas provenientes del Fondo Nacional de la Vivienda para los Trabajadores destinados al arrendamiento social, adquisición, construcción, reparación, ampliación o mejoras de vivienda o al pago de pasivos adquiridos por estos conceptos. Estos descuentos deberán haber sido aceptados libremente por la persona trabajadora y no podrán exceder el 20 por ciento del salario para préstamos y 30 por ciento del salario para rentas."
    },
    {
      "Fracción": "IV",
      "Texto": "Pago de abonos para cubrir créditos otorgados o garantizados por el Instituto a que se refiere el artículo 103 Bis de esta Ley, destinados a la adquisición de bienes de consumo duradero o al pago de servicios. Estos descuentos estarán precedidos de la aceptación que libremente haya hecho el trabajador y no podrán exceder del 10% del salario."
    }
  ],
  "Párrafos": [],
  "NotasOrientadoras": [
    "Establece que el salario mínimo está protegido contra descuentos, salvo en casos excepcionales.",
    "Reconoce pensiones alimenticias como prioridad legal sobre el ingreso mínimo.",
    "Permite descuentos por vivienda y créditos solo si hay aceptación voluntaria y límites porcentuales.",
    "Evita abusos financieros que comprometan la subsistencia del trabajador.",
    "**Principio rector: Inembargabilidad relativa del salario mínimo para garantizar condiciones dignas.**"
  ]
  },
  {
  "PalabraClave": "Pago directo, apoderado, pago a cualquier persona mediante carta poder",
  "Ley": "Ley Federal del Trabajo",
  "Artículo": "100",
  "Texto": "El salario se pagará directamente al trabajador. Sólo en los casos en que esté imposibilitado para efectuar personalmente el cobro, el pago se hará a la persona que designe como apoderado mediante carta poder suscrita por dos testigos.",
  "Fracciones": [],
  "Párrafos": [
    {
      "Párrafo": "2",
      "Texto": "El pago hecho en contravención a lo dispuesto en el párrafo anterior no libera de responsabilidad al patrón."
    }
  ],
  "NotasOrientadoras": [
    "Establece que el salario debe entregarse directamente al trabajador.",
    "Permite excepciones solo mediante carta poder formal con testigos.",
    "Protege al trabajador frente a pagos indebidos o simulados.",
    "Advierte que el patrón sigue siendo responsable si incumple esta regla.",
    "**Principio rector: Personalidad jurídica del trabajador en el cobro de su salario.**"
  ]
  }
]